{
  "intents": [
    {
  "tag": "greeting",
  "patterns": [
    "কেমন আছো তুমি?",
    "হ্যালো, কেমন কাটছে সময়?",
    "ওহে, তোমার নতুন কি?",
    "হ্যালো, তুমি কি ভালো আছো?",
    "কেমন যাচ্ছে তোমার দিন?",
    "হ্যালো, কি খবর?",
    "আপনি কি চলবেন?",
    "কেমন করে চলছে সব?",
    "হ্যালো, তুমি কি ঠিক আছো?",
    "কেমন আছো তুমি এই সময়ে?",
    "ওহে, আপনি কি সেখানে?",
    "হ্যালো, কেমন আছেন?",
    "কেমন করে আছো তুমি এখানে?",
    "কি খবর, তোমার দিন কেমন কাটছে?",
    "হ্যালো, তোমার জন্য কি করতে পারি?"
  ],
  "responses": [
    "আরে :-)",
    "হ্যালো, দেখার জন্য ধন্যবাদ",
    "হাই, আমি আপনার জন্য কি করতে পারি?",
    "হাই, আমি কিভাবে সাহায্য করতে পারি?",
    "আমি ভালো আছি, ধন্যবাদ",
    "কোন কিছু সাহায্য করতে চাচ্ছো?",
    "আপনির জন্য কোন সাহায্য চাই?",
    "হ্যালো! আমি কি আপনার কাছে কোন সাহায্য করতে পারি?",
    "আপনার জন্য যদি আমি কিছু করতে পারি তাহলে বলুন",
    "ধন্যবাদ, আমি ভালো আছি",
    "আমি আছি, আপনি কেমন আছেন?",
    "কেমন করে যাচ্ছে তোমার দিন?",
    "হ্যালো, কি খবর?",
    "আপনি কি চলবেন?",
    "কেমন করে চলছে সব?"
  ]
},

    {
  "tag": "farewell",
  "patterns": [
    "এখন প্রস্থান করছি",
    "আমি এখন চলছি",
    "বিদায় নিতে চলেছি",
    "একটু পরে ফিরে আসব",
    "হ্যাঁ, চলতে হচ্ছে",
    "ফিরে যাওয়ার সময় হয়েছে",
    "এই যাত্রা শেষ হচ্ছে",
    "আমি এখন ছুটির জন্য এসেছি",
    "একটু পরে আবার দেখা হবে",
    "আমি এখন অফিস ছেড়ে আসছি",
    "বিদায়, এই যাত্রা আমার জন্য অমূল্য ছিল",
    "আমি এই সময়ে চলতে চাই",
    "বিদায়, শুভকামনা রইল",
    "তোমাদের সাথে সময় কাটার জন্য ধন্যবাদ",
    "এখন আমি বাড়ি ফিরছি"
  ],
  "responses": [
    "বিদায়! ভাল থাকবেন।",
    "পরে দেখা হবে!",
    "বিদায়, আশা করি আবার দেখা হবে।",
    "ফিরে যাওয়ার আগে ধন্যবাদ!",
    "হ্যাঁ, তাদের সাথে যাচ্ছি, আবার দেখা হবে।",
    "ভালো থাকবেন, বিদায়!",
    "আপনির সাথে সময় কাটার জন্য ধন্যবাদ, বিদায়!",
    "আবার দেখা হবে, ভালো থাকবেন!",
    "বিদায়! যত্ন নিন এবং সুস্থ থাকুন।",
    "বিদায় নিচ্ছি, আবার দেখা হবে!",
    "শুভ কামনা রইল, আবার দেখা হবে।",
    "বিদায়! ভালো থাকবেন এবং আবার দেখা হবে।",
    "হ্যাঁ, এখান থেকে প্রস্থান করছি, ভালো থাকবেন!",
    "বিদায় নিচ্ছি, তোমার সাথে সময় কাটার জন্য ধন্যবাদ!",
    "ফিরে যাচ্ছি, আবার দেখা হবে, শুভকামনা!"
  ]
},

    {
  "tag": "thanks",
  "patterns": [
    "আপনার সাহায্যের জন্য ধন্যবাদ জানাই",
    "ধন্যবাদ আপনি খুব ভালো মানুষ",
    "এই সময়ে আপনির সাহায্যে আমি অনেক খুশি",
    "ধন্যবাদ জনাই, এটা আমার জন্য অনেক মানে রেখেছে",
    "আপনার উপকারে আমি কখনো ভুলতে পারবো না",
    "একজন উপকারী মানুষ হিসেবে ধন্যবাদ জানাই",
    "আপনির কাছে যে সাহায্য পেয়েছি তা জানাতে আমি ধন্যবাদ জানাই",
    "ধন্যবাদ আপনির কাছে আসার জন্য, আমি খুব খুশি",
    "আমার জন্য আপনির সাহায্য অমূল্য",
    "আমি এটা অসম্মানিত করতে পারছি না, ধন্যবাদ",
    "এটা আমার জন্য অনেক বড় উপকার",
    "ধন্যবাদ জানাই, তোমার সাহায্য বেশ মূল্যবান",
    "অসাধারণ! ধন্যবাদ জানাই",
    "আমি আপনার সাহায্যে আভাস করছি, ধন্যবাদ",
    "আমি আপনার কাছে কৃতজ্ঞ, ধন্যবাদ"
  ],
  "responses": [
    "আপনাকে স্বাগতম!",
    "আমি সাহায্য করতে পেরে আনন্দিত.",
    "কোনও সমস্যা নেই, সহায়তা করে খুশি।",
    "যে কোনও সময়!আপনার আরও সাহায্যের প্রয়োজন হলে আমাকে জানান।",
    "কোন সমস্যা নেই, আমি আপনার কাছে যত্ন নিতে চাই।",
    "প্রয়োজন হলে আমাকে বলুন, ধন্যবাদ!",
    "আমি আপনার কাছে কৃতজ্ঞ, এটা আমার কর্তব্য।",
    "সহায়ক হতে পারলে আমি খুশি, আপনি যদি কোনো সময় সাহায্য চান।",
    "আপনির প্রশংসা জানাতে ধন্যবাদ, এটা আমার জন্য একটি প্রয়োজনীয় ইনস্পিরেশন।",
    "আমি আপনার সাথে এটা করতে খুব খুশি, ধন্যবাদ!",
    "ধন্যবাদ জানাই, এটা আমার জন্য একটি সুখ এবং গর্বের সূত্র।",
    "কোনও সমস্যা হলে আমাকে জানান, আমি সাহায্য করতে চাই।",
    "যত্ন নিবেন, আমি সব সময় আপনার জন্য এখানে আছি।",
    "ধন্যবাদ, আমি যে কোনো সময় আপনার সাহায্যে সাজিয়ে দেতে চাই।",
    "আপনার উপকারে আমি মন্নত বোধ করছি, ধন্যবাদ!"
  ]
},

    {
      "tag": "about_bot",
      "patterns": 
      [
        "তুমি কি কর?", 
        "তুমি কে?", 
        "আমাকে নিজের সম্পর্কে বলুন"
      ], 
      "responses": 
      [
        "আমি আপনাকে সহায়তা করার জন্য ডিজাইন করা একটি চ্যাটবট।",
        "আমি আপনাকে সাহায্য করার জন্য এখানে একজন ভার্চুয়াল সহকারী।", 
        "আমি আপনার প্রশ্নের উত্তর দিতে এবং সহায়তা প্রদানের জন্য তৈরি একটি চ্যাটবট।"
      ]
    },
    {
  "tag": "help",
  "patterns": [
    "আমার সাহায়তা দরকার",
    "কেউ সাহায্য করতে পারবে?",
    "আমি কি নিজে সমাধান করতে পারব?",
    "সাহায্য চাই, কেউ আছে?",
    "আমি একটি সমস্যার মধ্যে পড়েছি",
    "আমি একটি প্রশ্ন করতে চাই",
    "আমি বুঝতে পারছি না, সাহায্য করুন প্লিজ",
    "সাহায্য দিন, আমি অস্তিত্বে আছি!",
    "কিছু প্রস্তুতি আছে তো না, সাহায্য চাই",
    "আমি আমার কাজে সমস্যা হচ্ছে",
    "সাহায্য করতে চাই, কেউ আছে?",
    "একটি জিনিস না বুঝতে পারছি, সাহায্য করুন প্লিজ",
    "আমি একটি তথ্য খুঁজছি, কেউ সাহায্য করতে পারবেন?",
    "আমি কি ভুল করতে চলেছি?",
    "একটি কম্পিউটার সমস্যা হচ্ছে, কেউ সাহায্য করতে পারবেন?",
    "আমি একটি প্রজেক্টে অস্থির, কেউ সাহায্য করতে চাই"
  ],
  "responses": [
    "অবশ্যই! আপনার কি ধরনের সাহায্য দরকার?",
    "আমি এখানে সাহায্য করতে এসেছি। আমি আপনার জন্য কি করতে পারি?",
    "অবশ্যই, আমি আপনাকে সহায়তা করার জন্য যথাসাধ্য চেষ্টা করব। ব্যাপারটা কি?",
    "কিছু প্রশ্ন থাকলে বলুন, আমি সাহায্য করতে চাই।",
    "আপনির সমস্যা কি? আমি আপনার জন্য সাহায্য করতে চাই।",
    "আপনি কোন সমস্যায় পড়ছেন? আমি সাহায্য করতে চাই।",
    "আপনি কোন জিজ্ঞাসা করতে চাচ্ছেন? আমি যদি সাহায্য করতে পারি, তাহলে বলুন।",
    "এটা খুব স্বাভাবিক যে আপনি সাহায্য চান, আমি এখানে আছি!",
    "আপনি কোন কাজে সমস্যা হচ্ছে? আমি চেষ্টা করব সাহায্য করতে।",
    "আপনি কী সাহায্য চান? আমি যদি সাহায্য করতে পারি, তাহলে বলুন।",
    "আপনি একটি কম্পিউটার সমস্যায় আছেন তা মন্তব্য করুন, আমি সাহায্য করতে চাই।",
    "আমি আপনার জন্য কিছু করতে চাই, বলুন কী সাহায্য চান।",
    "আপনি যদি আমার কাছে কোন প্রশ্ন থাকেন, তাদের প্রশ্ন করুন।",
    "আমি কীভাবে সাহায্য করতে পারি? আপনার যেকোনো চিন্তা থাকলে আমাকে বলুন।",
    "আমি তোমার সহায়তা করতে প্রস্তুত। তোমার প্রশ্ন বলো কি?",
    "তোমার কাছে যে কোনও সমস্যা থাকলে বলো, আমি সাহায্য করতে চাই।"
  ]
},
    {
  "tag": "weather",
  "patterns": [
    "আজ বৃষ্টি হচ্ছে কি না?",
    "এখন আবহাওয়া কেমন?",
    "আজ সকালের আবহাওয়া কেমন?",
    "কালকে কি বৃষ্টি প্রেক্ষাপণ হবে?",
    "এই সপ্তাহে আবহাওয়া কেমন থাকতে পারে?",
    "বর্তমানে কি আবহাওয়া চলছে?",
    "আবহাওয়া সম্পর্কে কিছু জানান",
    "বৃষ্টির সম্ভাবনা কত?",
    "এখন প্রায়ই বৃষ্টি হয় তা কি?",
    "আজ সকালে তাপমাত্রা কত?",
    "কি আছে বর্তমানে আবহাওয়া স্থিতি?",
    "পরবর্তী কয়েক ঘণ্টায় আবহাওয়া কি হবে?",
    "এখন তাপমাত্রা কত?",
    "বৃষ্টির প্রেক্ষাপণ কবে হতে পারে?",
    "আবহাওয়া কি শীঘ্রই পরিবর্তন হতে চলেছে?"
  ],
  "responses": [
    "আমি দুঃখিত, বর্তমানে আমার কাছে আবহাওয়ার তথ্য নেই। আপনি সর্বশেষ আপডেটের জন্য কোনও আবহাওয়ার ওয়েবসাইট বা অ্যাপলিকেশন চেক করতে পারেন।",
    "দুর্ভাগ্যক্রমে, আমি বর্তমান আবহাওয়ার তথ্য সরবরাহ করতে পারি না। সঠিক বিশদের জন্য দয়া করে একটি নির্ভরযোগ্য আবহাওয়ার উত্স পরীক্ষা করুন।",
    "আমি দুঃখিত, আবহাওয়ার তথ্য আমার কাছে নেই, তবে আপনি একটি ভাল আবহাওয়ার ওয়েবসাইট বা অ্যাপলিকেশন দেখতে পারেন।"
  ]
},

    {
  "tag": "jokes",
  "patterns": [
    "একটি মজার কাহিনি শোনাও",
    "রসিক কিছু বলুন",
    "একটি মিষ্টি হাসির কথা বলুন",
    "হাসির একটি জোকস দিন",
    "একটি রসিক বিচারের সহযোগিতা দিন",
    "কিছু হাসির কথা বলুন",
    "মন ভালো করার জন্য একটি জোকস দিন",
    "হাসতে হাসতে ঘুম আসতে চলবে",
    "আমাকে একটি হাসির কথা বলুন",
    "হাসির একটি জোকস শোনান",
    "মিষ্টি কিছু বলুন",
    "আমাকে একটি রসিক কথা বলুন",
    "মন ভালো করার জন্য একটি মজার জোকস দিন",
    "দোকানে বাজারে গিয়ে ব্যবস্থাপনা হাসিতে চোখ জোরায় দিতে পারে",
    "আমার দিনটি মিষ্টি হবে তাই একটি মজার কাহিনি দিন"
  ],
 "responses": [
    "এটি একটি হাস্যকর কথা: একটি টুপি কেন কখনই একটি বই পড়তে পারে না? কারণ তা মাথায় বই থাকে না!",
    "একটি রসিক জোকস: বোতল গোলি কেন হাসতে পারে না? কারণ তার মাথায় ছোট ছোট কোড আছে!",
    "হাস্যকর একটি ঘটনা: একটি কাক রেস্তোরাঁয় প্রবেশ করে বসলো এবং ওই জায়গার মাঝে বসে কাক বোঝাচ্ছে, 'মিষ্টি আম ভুনা হোক।'",
    "হাস্যকর একটি প্রশ্ন: বুকের ভিতর কি আছে? প্রশ্নটির উত্তর: পেজ!",
    "একটি কম্পিউটার কার্যকর করতে বলছে: 'ডিস্ক চেক করুন।' ব্যবহারকারী প্রশ্ন করছে: 'কোন ডিস্ক?' কম্পিউটার উত্তর দিচ্ছে: 'চালু হয়ে যাচ্ছি, আপনি একটি প্রশ্ন করতে হয়েছে!'",
    "একটি মজার জোকস: মামা, আপনি কীভাবে একটি হাতি একটি মোসলা দিতে পারেন? উত্তর: মোসলা একটি হাতির মোসলা!",
    "হাস্যকর একটি ঘটনা: একজন প্রধানমন্ত্রী বলছেন, 'আমি সকল সমস্যা সমাধান করতে পারবো!' এক প্রতিষ্ঠানের কর্মী বলছে, 'হ্যাঁ, তোমাদের যা সমস্যা হয়, সেগুলি কী?'",
    "হাস্যকর একটি প্রশ্ন: মাছের মুখে কেমন হয়েছে? উত্তর: মাছের মুখ হয়নি!",
    "একটি হাস্যকর অভিজ্ঞান: কোনও কিছুই পাওয়া যায় না বললে কি হয়? উত্তর: মোবাইল সুইচ অফ!",
    "হাস্যকর একটি মন্তব্য: 'আমি একটি বিস্ফোরক সকালের জন্য খুব ভালো ব্যাপার আশা করছি, কারণ আমার সার্কাডে একটি আত্মবিস্ফোরক ঘটনা হবে!'",
    "হাস্যকর একটি প্রশ্ন: সম্রাট আকবর কখন রাতে ঘুমাতেন? উত্তর: তিন দিনে একবার, মঙ্গলবার!",
    "হাস্যকর একটি ঘটনা: একজন গল্পকার বলছে, 'আমি একটি গল্প লিখতে চলেছি এবং এটি চমৎকার হয়েছে, কিন্তু শুরু হলেই মগজ কিছু চাই না!'",
    "একটি মজার প্রশ্ন: আবার কোথাও গিয়েছিলেন? উত্তর: হ্যাঁ, এইচ আয়ারল্যান্ড!",
    "হাস্যকর একটি মন্তব্য: 'একটি শিক্ষক বলছে, 'তোমরা সবাই কেমন তৈরি হও!' একটি ছাত্র উত্তর দিচ্ছে, 'বুঝি, আমরা তো তৈরি পড়তে হবে!'",
    "হাস্যকর একটি জোকস: বুলবুলের প্রিয় ফুটবল খেলা কি? উত্তর: বোলবল!"
  ]
},

    {
      "tag": "tech_support",
      "patterns": 
        [
          "আমার কম্পিউটার কাজ করছে না",
          "আমার একটি প্রযুক্তিগত সমস্যা আছে",
          "আমার ডিভাইসে সহায়তা করুন"
        ],
      "responses": 
        [
          "আমি কোনও প্রযুক্তিগত সহায়তা বিশেষজ্ঞ নই, তবে আমি কিছু সাধারণ পরামর্শ দেওয়ার চেষ্টা করতে পারি।আপনার কি এটি বন্ধ করে আবার চালু করার চেষ্টা আছে?",
          "প্রযুক্তিগত সমস্যার জন্য, আপনার ডিভাইসের সহায়তার সাথে যোগাযোগ করা বা সহায়তার জন্য কোনও পেশাদার প্রযুক্তিবিদ পরামর্শের সাথে পরামর্শ করা ভাল।"
        ]
    },
    {
      "tag": "movies", 
      "patterns": 
        [
          "একটি সিনেমা সুপারিশ",
          "দেখার জন্য একটি ভাল চলচ্চিত্র কি?",
          "জনপ্রিয় সিনেমা সম্পর্কে বলুন"
        ],
      "responses": 
        [
          "অবশ্যই, আমি [চলচ্চিত্রের শিরোনাম] চেক আউট করার পরামর্শ দিচ্ছি।এটি দুর্দান্ত পর্যালোচনা এবং একটি আকর্ষণীয় প্লট আছে!",
          "আপনি যদি [জেনার] এর মধ্যে থাকেন তবে আপনি [চলচ্চিত্রের শিরোনাম] উপভোগ করতে পারেন।এটি শ্রোতাদের দ্বারা অত্যন্ত রেট করা হয়েছে।"
        ]
    },
    {
  "tag": "food",
  "patterns": [
    "কোন খাবার খাব?",
    "একটি রেস্তোঁরা সুপারিশ দিন",
    "তোমার প্রিয় খাবার সম্পর্কে আমাকে বলুন",
    "আমি কী খাব?",
    "তোমার পছন্দগুলি কী?",
    "কোন খাদ্যদ্রব্য তুমি পছন্দ করো?",
    "খাওয়ার জন্য কোন রেস্তোরাঁ ভালো?",
    "আজ কি খাব?",
    "তুমি কি ভোজন করতে চাও?",
    "তোমার মধ্যে সবচেয়ে প্রিয় খাবার কী?",
    "কোন রেস্তোঁরা সুপারিশ করবে?",
    "আমি কী খাবার খুজছি?",
    "কোন রেস্তোরাঁ সহজেই পৌঁছাতে পারি?",
    "তোমার খাবার পছন্দ কী?",
    "কোন খাদ্যদ্রব্য তুমি অধিক পছন্দ করো?"
  ],
   "responses": [
    "আমি খাবারের ব্যপারে খুব উৎসাহী! কোন খাদ্যদ্রব্য খুজছেন?",
    "খুশি হয়ে যেনো আমি খাদ্যের সুপারিশ করতে পারি। আপনি কোন ধরনের খাবার পছন্দ করেন?",
    "চমৎকার! এটি আমার প্রিয় বিষয়ের মধ্যে একটি। তোমার প্রিয় খাবার কী?",
    "আমি একটি সুজুকি রেস্তোঁরা জানি যেখানে আপনি সুস্বাদু খাবার পাবেন।",
    "আমি শুনেছি 'গ্রিল হাউজ' একটি ভালো স্থান হতে পারে খাওয়ার জন্য। তোমার ভালো লাগলে প্রবেশ করতে পারেন।",
    "কোন খাবারে আপনি কিছু পছন্দ করেন না? আমি কোথাও নতুন তাদের পুরো সাইট দেখতে সাহায্য করতে পারি!",
    "আজ আপনি কি খাতে ইচ্ছুক?",
    "একটি সময় আমি কলকাতায় একটি সাইডওয়াক রেস্তোঁ পরিচিত ছিলাম, 'কাওরি ক্লাব'। এখানে আপনি ভালো খাবার পাবেন।",
    "খাদ্যে আমি পুরোপুরি মন্তব্য করি! কোন খাবার পছন্দ করতে চান?",
    "ভালো লাগলে বলতে পারেন, আমি সুপারিশ দিতে ভালোবাসি! আপনি কোন স্পেসিফিক খাবার খুজছেন?",
    "মহান হয়ে যেনো আমি আপনাকে একটি অসাধারণ খাদ্যের অভিজ্ঞান দেতে পারি! আপনি কোন খাদ্যদ্রব্য পছন্দ করেন?",
    "খুব ভালো! তোমার প্রিয় রেস্তোরাঁ কোথায়?",
    "আমি শোনেছি 'ফুডিশ' খুব জনপ্রিয় একটি রেস্তোঁ হোয়ারের জন্য। তুমি এটি পরীক্ষা করতে চাও?",
    "আমি শুনেছি একটি বৃহত্তর মহানগরে একটি নতুন স্থান, 'ফ্যাশন ফুডি' যা মিশ্রিত খাদ্যের জন্য জনপ্রিয়। আপনি প্রয়াত হয়ে এটি চেষ্টা করতে চাচ্ছেন তো?",
    "আমি শুনেছি 'স্ট্রিট ফুড ফেস্ট' আসতে পারে। এটি হোয়ারে বিভিন্ন খাদ্য সমৃদ্ধি দিতে পারে!"
  ]
},

    {
  "tag": "music",
  "patterns": [
    "একটি গানের সুপারিশ",
    "তোমার প্রিয় সঙ্গীত কি?",
    "জনপ্রিয় শিল্পীদের সম্পর্কে আমাকে বলুন",
    "কোন শিল্পীর সঙ্গে তুমি সবচেয়ে সহজে সম্পর্ক করতে পারো?",
    "আমি [শিল্পী] এর একটি সুর ভালোবাসি।",
    "তোমার পছন্দের জেনার কি?",
    "আমি একটি [জেনার] গান পরামর্শ করতে পারি।",
    "তোমার মন্তব্যে ভিত্তি করে, [শিল্পী] এর একটি সুপারিশ দিতে পারি।",
    "কোন সঙ্গীত শৈলী তোমার পছন্দ?",
    "আমি একটি [সঙ্গীত শৈলী] গান পরামর্শ করতে পারি।",
    "কোন দশকের সঙ্গীত তোমার প্রিয়?",
    "তোমার প্রিয় গানের সঙ্গীত কোন দেশ থেকে?",
    "আমি একটি [দেশ] শিল্পীর গান পরামর্শ করতে পারি।",
    "কোন সময়ে তুমি সবচেয়ে বেশি সঙ্গীত শোনো?",
    "তোমার মন্তব্য ভিত্তি করে, আমি একটি নতুন [শিল্পী] শোনার পরামর্শ দিতে পারি।"
  ],
  "responses": [
    "আমি 'সাম স্মিথ' দ্বারা 'লস্ট ইন ইউ' পরামর্শ করছি। এটি একটি দুর্দান্ত ট্র্যাক!",
    "আপনি যদি 'রক' পছন্দ করেন তবে আপনি 'জিমি হেন্ডরিক্স' এর সংগীত উপভোগ করতে পারেন।",
    "আমি 'মেগান স্টাইল' দ্বারা 'আলাদিন' গান পরামর্শ করছি। এটি খুবই মহান!",
    "তুমি 'ববি ব্রাউন' এর সাথে সহজেই সম্পর্ক করতে পারো।",
    "আমি 'হিপ-হপ' জেনারের একটি 'কেন্ড্রিক লামার' গান পরামর্শ করছি। এটি অসাধারণ!",
    "তুমি 'পপ' সঙ্গীত পছন্দ করলে তুমি 'আডেল' এর গান শোনতে পারো।",
    "আমি 'রক' জেনারের 'কুইন' এর একটি গান পরামর্শ করছি। সত্যিই রক!",
    "তুমি 'পপ' সঙ্গীত ভালোবাসলে 'এড শিরান' এর কিছু গান শোনো।",
    "আমি 'কাউন্ট্রি' সঙ্গীতের 'টেইলর সুইফট' এর একটি গান পরামর্শ করছি।",
    "আমি 'ক্লাসিক' সঙ্গীতে 'বেথহোভেন' এর একটি সুন্দর সুর পরামর্শ করছি।",
    "আমি 'রক' জেনারের 'গান্স এন্ড রোজেস' এর একটি রক গান পরামর্শ করছি।",
    "তুমি 'জ্যাজ' সঙ্গীত পছন্দ করলে 'মাইল্স ডেভিস' এর কিছু সুন্দর সুর শোনো।",
    "তুমি 'এলটারনেটিভ' সঙ্গীত ভালোবাসলে 'ইমেজিন ড্রাগনস' এর গান শোনো।",
    "আমি 'ক্লাসিক' সঙ্গীতে 'বাচ' এর একটি ক্যান্টাটা পরামর্শ করছি।",
    "তুমি 'রক' সঙ্গীত পছন্দ করলে 'লেড জেপলিন' এর কিছু সুন্দর সুর শোনো।",
    "আমি 'পপ' সঙ্গীতে 'বিলি আইলিশ' এর একটি গান পরামর্শ করছি।"
  ]
},

    {
  "tag": "travel",
  "patterns": [
    "আমাকে একটি দুর্দান্ত ভ্রমণ গন্তব্য সম্পর্কে বলুন",
    "একটি অবকাশ স্পট সুপারিশ",
    "ভ্রমন পরামর্শ",
    "তোমার সবচেয়ে প্রিয় ভ্রমণ গন্তব্য কোথা?",
    "আমার একটি প্রিয় ভ্রমণ গন্তব্য হল 'সাফারি পার্ক'। এখানে প্রাকৃতিক সৌন্দর্যের অপরিসীম দৃশ্য রয়েছে।",
    "তুমি যদি শান্তি এবং প্রাকৃতিক সৌন্দর্য চাও তাহলে 'মাউন্ট এভারেস্ট' পরিদর্শন করো।",
    "ভ্রমন পরামর্শের জন্য, আমি অনুমোদন করছি 'ভূতান'। এটি একটি স্বাস্থ্যকর এবং চিরকাল মনে থাকা যাবে।",
    "তুমি 'মালদ্বীপ' এ কি দেখতে পারবে সেটা অবশ্যই জান। এটি একটি অসাধারণ ভ্রমণ গন্তব্য।",
    "ভ্রমনে যাওয়ার জন্য আমি 'প্যারিস' সুপারিশ করতে পারি। এটি একটি সার্থক অভিজ্ঞতা হতে পারে!",
    "তুমি যদি সহজেই প্রাকৃতিক সৌন্দর্য এবং সাংস্কৃতিক অভিজ্ঞতা চাও, তাদের জন্য 'কিউবা' একটি আদর্শ স্থান।",
    "আমি 'মাচু পিচু' কে ভ্রমণ করার জন্য প্রস্তুতি নিয়েছি। এটি একটি অদৃশ্য গুহা এবং উড়িয়া দেখা গুফা সহিত অনেক আকর্ষণীয় জায়গা রয়েছে।",
    "আমি শুনেছি 'সির্কুলার কেনিয়া' এ ভ্রমণ করতে খুব ভালোবাসে। তুমি কোন বৃষ্টি সময়ে গিয়ে দেখতে চাও?",
    "ভ্রমণ করা হলে অবশ্যই 'টোকিও' দেখা হোক! এটি একটি অদ্ভুত এবং শহুরে ভ্রমণ হতে পারে।",
    "তুমি 'সেলুসিয়া' এর বারে কি ভাবছো? আমি শুনেছি এটি একটি প্রিয় ভ্রমণ গন্তব্য!",
    "তোমার জন্য একটি আশ্চর্যজনক ভ্রমণ গন্তব্য হতে পারে 'বার্সেলোনা'। এটি অত্যন্ত সুন্দর এবং সাংস্কৃতিক মাধ্যমে অমৃতবাণী।",
    "ভ্রমনের সময়ে, 'জামাইকা' এ একটি স্বাস্থ্যকর ও নিম্ন বাড়িও দেখা গুয়েছি। তুমি এখানে আনন্দ করতে পারো।"
  ],
  "responses": [
    "একটি আশ্চর্যজনক ভ্রমণের গন্তব্য হল 'সাফারি পার্ক'। এখানে প্রাকৃতিক সৌন্দর্যের অপরিসীম দৃশ্য রয়েছে।",
    "তুমি যদি শান্তি এবং প্রাকৃতিক সৌন্দর্য চাও তাহলে 'মাউন্ট এভারেস্ট' পরিদর্শন করো।",
    "ভ্রমন পরামর্শের জন্য, আমি অনুমোদন করছি 'ভূতান'। এটি একটি স্বাস্থ্যকর এবং চিরকাল মনে থাকা যাবে।",
    "তুমি 'মালদ্বীপ' এ কি দেখতে পারবে সেটা অবশ্যই জান। এটি একটি অসাধারণ ভ্রমণ গন্তব্য।",
    "ভ্রমনে যাওয়ার জন্য আমি 'প্যারিস' সুপারিশ করতে পারি। এটি একটি সার্থক অভিজ্ঞতা হতে পারে!",
    "তুমি যদি সহজেই প্রাকৃতিক সৌন্দর্য এবং সাংস্কৃতিক অভিজ্ঞতা চাও, তাদের জন্য 'কিউবা' একটি আদর্শ স্থান।",
    "আমি 'মাচু পিচু' কে ভ্রমণ করার জন্য প্রস্তুতি নিয়েছি। এটি একটি অদৃশ্য গুহা এবং উড়িয়া দেখা গুফা সহিত অনেক আকর্ষণীয় জায়গা রয়েছে।",
    "আমি শুনেছি 'সির্কুলার কেনিয়া' এ ভ্রমণ করতে খুব ভালোবাসে। তুমি কোন বৃষ্টি সময়ে গিয়ে দেখতে চাও?",
    "ভ্রমণ করা হলে অবশ্যই 'টোকিও' দেখা হোক! এটি একটি অদ্ভুত এবং শহুরে ভ্রমণ হতে পারে।",
    "তুমি 'সেলুসিয়া' এর বারে কি ভাবছো? আমি শুনেছি এটি একটি প্রিয় ভ্রমণ গন্তব্য!",
    "তোমার জন্য একটি আশ্চর্যজনক ভ্রমণ গন্তব্য হতে পারে 'বার্সেলোনা'। এটি অত্যন্ত সুন্দর এবং সাংস্কৃতিক মাধ্যমে অমৃতবাণী।",
    "তোমার জন্য একটি আশ্চর্যজনক ভ্রমণ গন্তব্য হতে পারে 'স্যান ফ্রান্সিস্কো'। এটি একটি উত্কৃষ্ট শহর এবং অনেক আদর্শ স্থান রয়েছে!",
    "স্বাচ্ছন্দ্যময় ভ্রমণের জন্য, 'মালদ্বীপ' এ যাওয়া চলুক। এটি একটি প্রাকৃতিক সৌন্দর্যের জন্য পরিচিত এবং মাধ্যমে সুস্থ হওয়ার জন্য একটি অসাধারণ স্থান।",
    "আমি শুনেছি 'নাইগ্রা ফলস' এ ভ্রমণ করতে খুব মজা করে। তুমি কি চেষ্টা করতে পারো?",
    "তুমি 'রোমান্টিক গেটওয়ে' চাও? তাদের মধ্যে একটি হল 'প্যারিস'। এটি অমৃতবাণীতে সান্দরভ ও শান্তি মূলক থাকতে পারে!"
  ]
},

    {
  "tag": "education",
  "patterns": [
    "আমাকে অনলাইন কোর্স সম্পর্কে বলুন",
    "একটি বই সুপারিশ",
    "অধ্যয়নের টিপস",
    "কোনও বিষয়ে অধ্যয়ন করতে কোথায় শুরু করব?",
    "বিজ্ঞানে অগ্রগতির জন্য একটি সুপারিশ দিন",
    "আমি প্রোগ্রামিং শেখা চাই, কোন অনলাইন কোর্স সুপারিশ করবেন?",
    "একটি ইংরেজি গ্রামার বই প্রস্তুত হতে কোনও উপায় সুপারিশ করুন",
    "ফিজিক্স পড়ার জন্য কোনও গুরুত্বপূর্ণ বই আছে?",
    "আমি হিস্টোরি পড়ার জন্য একটি সুপারিশ চাই",
    "কোনও ভাষা শেখা শুরু করতে একটি কাজবল প্ল্যাটফর্ম কোথায় পাওয়া যায়?",
    "আমি নতুন সফটওয়্যার ডেভেলপমেন্ট শেখা চাই, সেইসব জন্য একটি বই সুপারিশ করুন",
    "গণিতে ভালো হতের জন্য একটি সুপারিশ দিন",
    "একটি ক্যারিয়ার শুরু করার জন্য উপযোগী টিপস দিন",
    "আমি প্রতি দিন নতুন কিছু শেখা চাই, এটি কোর্স বা বই দিয়ে কোরবো?",
    "মাইক্রোবায়োলসি শেখার জন্য একটি সুপারিশ দিন",
    "কোনও ক্যারিয়ার মাধ্যমে সফল হতের জন্য যে কোনও উপযোগী সুপারিশ দিন"
  ],
  "responses": [
    "বিভিন্ন বিষয়ে অনেকগুলি অনলাইন প্ল্যাটফর্ম রয়েছে।বিস্তৃত কোর্সের জন্য 'কোর্সের হেডলাইন' চেক আউট বিবেচনা করুন।",
    "একটি উচ্চ প্রস্তাবিত বই 'জেনিফার স্মিথ' দ্বারা 'বইয়ের শিরোনাম'।এটি তথ্যবহুল এবং আকর্ষক।",
    "ব্যক্তিগত উন্নতির জন্য 'এডুকেশন টিপস' দেওয়া হলো: প্রতি দিন নির্ধারিত সময়ে পড়া এবং সীমানা রেখে নতুন কিছু শেখার চেষ্টা করুন।",
    "শুরু করার জন্য শ্রেষ্ঠ স্থান 'কোরসেয়ার উনিভার্সিটি'। তারা বিজ্ঞানে অগ্রগতি করতে সাহায্য করতে পারে।",
    "আপনি যদি 'কোডিং' শেখা চান তবে 'কোড একাডেমি' এ চেক করুন। তারা অগ্রগতির জন্য ভালো একটি প্ল্যাটফর্ম।",
    "ইংরেজিতে উন্নতি পেতে 'ওকে' এ একটি কোর্স দেখুন। তারা বই এবং সহায়ক সামগ্রীর সাথে শিক্ষা দান করে।",
    "ফিজিক্স পড়ার জন্য 'স্টেফেন হকিং' দ্বারা 'এ ব্রিফ হিস্ট্রি অফ টাইম' বইটি চেক করুন। এটি প্রস্তুত এবং মজার।",
    "আপনি যদি 'হিস্টোরি' পড়া চান তবে 'ওক্সফোর্ড হ্যান্ডবুক অফ হিস্টোরি' বইটি একটি চমৎকার সুপারিশ।",
    "আপনি যদি 'ভাষা' শেখা চান তবে 'ডুওলিঙ্গো' এ অবশ্যই দেখুন। এটি একটি ভালো ভাষা শেখার উপায়।",
    "বিজ্ঞানে অগ্রগতির জন্য 'কার্নেগি মেলন ইউনিভার্সিটি' থেকে একটি অনলাইন কোর্স দেখুন।",
    "গণিতে সুধারান আপনি 'খান একাডেমি' দেখুন। তারা মাধ্যমে আপনি গণিতে ভালো হতে সাহায্য করতে পারে।",
    "একটি ব্যক্তিগত উন্নতির জন্য প্রশিক্ষণ প্ল্যান বানানোর জন্য 'এডুকেশন টিপস' চেক করুন।",
    "প্রতি দিন নতুন কিছু শেখা চাওয়ার জন্য 'ডেইলি লার্নিং টিপস' চেক করুন। এটি আপনার উন্নতি করতে সাহায্য করতে পারে।",
    "মাইক্রোবায়োলসি শেখার জন্য 'স্ট্যানফোর্ড ইউনিভার্সিটি' থেকে একটি অনলাইন কোর্স করুন। এটি প্রযুক্তিগত দক্ষতা সরবরাহ করতে সাহায্য করতে পারে।",
    "কোনও ক্যারিয়ার মাধ্যমে সফল হতে কোনও উপযোগী সুপারিশ দিতে 'ক্যারিয়ার টিপস' চেক করুন"
  ]
}]
}