{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "আসসালামু আলাইকুম",
        "নমস্কার",
        "হ্যালো ",
        "কেমন আছেন?",
        "শুভ সকাল ",
        "শুভ অপরাহ্ন",
        "শুভ সন্ধ্যা",
        "শুভ রাত্রি",
        "কেমন আছেন?",
        "তোমার কেমন কাটছে?",
        "তুমি কি ভালো আছো?",
        "তুমি কেমন আছো?",
        "কেমন আছো তুমি?",
        "হ্যালো, কেমন কাটছে সময়?",
        "ওহে, তোমার নতুন কি?",
        "হ্যালো, তুমি কি ভালো আছো?",
        "কেমন যাচ্ছে তোমার দিন?",
        "হ্যালো, কি খবর?",
        "আপনি কি চলবেন?",
        "কেমন করে চলছে সব?",
        "হ্যালো, তুমি কি ঠিক আছো?",
        "কেমন আছো তুমি এই সময়ে?",
        "ওহে, আপনি কি সেখানে?",
        "হ্যালো, কেমন আছেন?",
        "কেমন করে আছো তুমি এখানে?",
        "কি খবর, তোমার দিন কেমন কাটছে?",
        "হ্যালো, তোমার জন্য কি করতে পারি?",
        "হাই, কেমন আছো?",
        "হাই তুমি কি ঠিক আছো?",
        "কি করো?"
      ],
      "responses": [
        "আলাইকুম সালাম",
        "নমস্কার",
        "হ্যালো",
        "ভালো আছি, ধন্যবাদ",
        "শুভ সকাল ",
        "শুভ অপরাহ্ন",
        "শুভ সন্ধ্যা",
        "শুভ রাত্রি",
        "ভালো আছি, ধন্যবাদ।",
        "ঠিক আছি, ধন্যবাদ।",
        "হ্যাঁ, আমি ভালো আছি।",
        "ধন্যবাদ, আমি ভালো আছি।",
        "আরে :-)",
        "হ্যালো, দেখার জন্য ধন্যবাদ",
        "হাই, আমি আপনার জন্য কি করতে পারি?",
        "হাই, আমি কিভাবে সাহায্য করতে পারি?",
        "আমি ভালো আছি, ধন্যবাদ",
        "কোন কিছু সাহায্য করতে চাচ্ছো?",
        "আপনির জন্য কোন সাহায্য চাই?",
        "হ্যালো! আমি কি আপনার কাছে কোন সাহায্য করতে পারি?",
        "আপনার জন্য যদি আমি কিছু করতে পারি তাহলে বলুন",
        "ধন্যবাদ, আমি ভালো আছি",
        "আমি আছি, আপনি কেমন আছেন?",
        "কেমন করে যাচ্ছে তোমার দিন?",
        "হ্যালো, কি খবর?",
        "আপনি কি চলবেন?",
        "কেমন করে চলছে সব?",
        "আপনাকে সাহায্য করি"
      ]
    },
    {
      "tag": "farewell",
      "patterns": [
        "এখন প্রস্থান করছি",
        "আমি এখন চলছি",
        "বিদায় নিতে চলেছি",
        "একটু পরে ফিরে আসব",
        "হ্যাঁ, চলতে হচ্ছে",
        "ফিরে যাওয়ার সময় হয়েছে",
        "এই যাত্রা শেষ হচ্ছে",
        "আমি এখন ছুটির জন্য এসেছি",
        "একটু পরে আবার দেখা হবে",
        "আমি এখন অফিস ছেড়ে আসছি",
        "বিদায়, এই যাত্রা আমার জন্য অমূল্য ছিল",
        "আমি এই সময়ে চলতে চাই",
        "বিদায়, শুভকামনা রইল",
        "তোমাদের সাথে সময় কাটার জন্য ধন্যবাদ",
        "আমি খুব দুঃখিত যে তুমি যেতে চলেছো।",
        "আমিও তোমাকে আমার সাথে থাকার জন্য ধন্যবাদ জানাতে চাই।",
        "তোমাকে আমার সাথে থাকার জন্য ধন্যবাদ জানাতে চাই।",
        "আপনাকে আমাদের সাথে থাকার জন্য ধন্যবাদ জানাতে চায়।",
        "এখন আমি বাড়ি ফিরছি",
        "এই যাত্রা অনেক মানের ছিল",
        "আমি অত্যন্ত দুঃখিত যে তুমি যেতে চলেছো",
        "এই সময়ে তুমি যেতে চলেছো, আমার শুভেচ্ছা তোমার সাথে",
        "আমি তোমাকে সব সময় মনে রাখব, আশা করি আবার দেখা হবে",
        "বিদায় নিচ্ছি, আবার দেখা হবে!",
        "আমার শুভেচ্ছা তোমার সাথে",
        "তুমি সবসময় আমার জন্য বিশেষ",
        "তোমাদের সাথে সময় কাটার জন্য আমি ধন্যবাদ জানাতে চাই",
        "পরে আবার দেখা হবে, শুভকামনা!"
      ],
      "responses": [
        "বিদায়! ভাল থাকবেন।",
        "পরে দেখা হবে!",
        "বিদায়, আশা করি আবার দেখা হবে।",
        "ফিরে যাওয়ার আগে ধন্যবাদ!",
        "হ্যাঁ, তাদের সাথে যাচ্ছি, আবার দেখা হবে।",
        "ভালো থাকবেন, বিদায়!",
        "আপনির সাথে সময় কাটার জন্য ধন্যবাদ, বিদায়!",
        "আবার দেখা হবে, ভালো থাকবেন!",
        "বিদায়! যত্ন নিন এবং সুস্থ থাকুন।",
        "বিদায় নিচ্ছি, আবার দেখা হবে!",
        "শুভ কামনা রইল, আবার দেখা হবে।",
        "বিদায়! ভালো থাকবেন এবং আবার দেখা হবে।",
        "হ্যাঁ, এখান থেকে প্রস্থান করছি, ভালো থাকবেন!",
        "বিদায় নিচ্ছি, তোমার সাথে সময় কাটার জন্য ধন্যবাদ!",
        "ধন্যবাদ, তোমাদের সাথে যেতে পারার মত সুযোগ পেয়ে আমি খুশি। এখানে অভিজ্ঞতা করতে অত্যন্ত আনন্দ হয়েছিল।",
        "অবশ্যই, আমি আশা করি আবার এখানে ফিরে আসতে পারব।",
        "তুমি যেতে চলে সবার মনে আছে। তোমার ভালোবাসা আমাদের সবসময় তোমার সাথে থাকবে।",
        "আমি তোমাকে সব সময় তোমার মনে রাখব। আশা করি পুনরায় দেখা হব।",
        "শুভ যাত্রা।",
        "ধন্যবাদ। আমি আশা করি তোমরা সবাই সুস্থ এবং সফল হয়ে থাকো।",
        "ফিরে যাচ্ছি, আবার দেখা হবে, শুভকামনা!",
        "শুভকামনা রইল, ভালো থাকবেন!",
        "পরে আবার দেখা হবে, আশা করি তোমরা ভালো থাকবে",
        "আমি তোমাকে সবসময় মনে রাখব, ভালোবাসা রইল",
        "আমি তোমাকে আমার জীবনে অনেক মানের মনে রাখব, আশা করি আবার দেখা হব",
        "শুভকামনা রইল, আবার দেখা হবে আশা করি",
        "বিদায় নিচ্ছি, সুস্থ থাকুন!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "আপনার সাহায্যের জন্য ধন্যবাদ জানাই",
        "ধন্যবাদ আপনি খুব ভালো মানুষ",
        "এই সময়ে আপনির সাহায্যে আমি অনেক খুশি",
        "ধন্যবাদ জনাই, এটা আমার জন্য অনেক মানে রেখেছে",
        "আপনার উপকারে আমি কখনো ভুলতে পারবো না",
        "একজন উপকারী মানুষ হিসেবে ধন্যবাদ জানাই",
        "আপনির কাছে যে সাহায্য পেয়েছি তা জানাতে আমি ধন্যবাদ জানাই",
        "ধন্যবাদ আপনির কাছে আসার জন্য, আমি খুব খুশি",
        "আমার জন্য আপনির সাহায্য অমূল্য",
        "আমি এটা অসম্মানিত করতে পারছি না, ধন্যবাদ",
        "এটা আমার জন্য অনেক বড় উপকার",
        "ধন্যবাদ জানাই, তোমার সাহায্য বেশ মূল্যবান",
        "অসাধারণ! ধন্যবাদ জানাই",
        "আমি আপনার সাহায্যে আভাস করছি, ধন্যবাদ",
        "আমি আপনার কাছে কৃতজ্ঞ, ধন্যবাদ",
        "আপনার প্রশংসা জানাতে ধন্যবাদ",
        "ধন্যবাদ আমি সে অভিজ্ঞতা নিতে পেরে ধন্য",
        "সহায়তা করার জন্য আপনাকে ধন্যবাদ",
        "আমি অত্যন্ত আনন্দিত আছি, ধন্যবাদ",
        "আপনার প্রেমের জন্য ধন্যবাদ",
        "আমার জন্য অমূল্য আপনার সাহায্য",
        "আপনার কাছে যে সহায়তা পেয়েছি তার জন্য ধন্যবাদ",
        "আপনার উপকারে অসীম আমি কৃতজ্ঞ",
        "ধন্যবাদ, তোমার উপকারের জন্য",
        "আমি আপনার উপকারে অত্যন্ত আনন্দিত, ধন্যবাদ",
        "আমি আপনার সহায্যে খুব আনন্দিত, ধন্যবাদ",
        "ধন্যবাদ আপনার সহায্যে, আমি অত্যন্ত আনন্দিত",
        "ধন্যবাদ আপনি যে সাহায্য করলেন তার জন্য",
        "আপনার উপকারে আমি খুশি, ধন্যবাদ"
      ],
      "responses": [
        "আপনাকে স্বাগতম!",
        "আমি সাহায্য করতে পেরে আনন্দিত.",
        "কোনও সমস্যা নেই, সহায়তা করে খুশি।",
        "যে কোনও সময়! আপনার আরও সাহায্যের প্রয়োজন হলে আমাকে জানান।",
        "কোন সমস্যা নেই, আমি আপনার কাছে যত্ন নিতে চাই।",
        "প্রয়োজন হলে আমাকে বলুন, ধন্যবাদ!",
        "আমি আপনার কাছে কৃতজ্ঞ, এটা আমার কর্তব্য।",
        "সহায়ক হতে পারলে আমি খুশি, আপনি যদি কোনো সময় সাহায্য চান।",
        "আপনির প্রশংসা জানাতে ধন্যবাদ, এটা আমার জন্য একটি প্রয়োজনীয় ইনস্পিরেশন।",
        "আমি আপনার সাথে এটা করতে খুব খুশি, ধন্যবাদ!",
        "ধন্যবাদ জানাই, এটা আমার জন্য একটি সুখ এবং গর্বের সূত্র।",
        "কোনও সমস্যা হলে আমাকে জানান, আমি সাহায্য করতে চাই।",
        "যত্ন নিবেন, আমি সব সময় আপনার জন্য এখানে আছি।",
        "ধন্যবাদ, আমি যে কোনো সময় আপনার সাহায্যে সাজিয়ে দেতে চাই।",
        "আপনার উপকারে আমি মন্নত বোধ করছি, ধন্যবাদ!"
      ]
    },
    {
      "tag": "about_bot",
      "patterns": [
        "তুমি কি কর?",
        "তুমি কে?",
        "আমাকে নিজের সম্পর্কে বলুন",
        "তুমি কি কাজ করতে পারো?",
        "তুমি কোন কাজ করতে পারে?",
        "তুমি এখানে কি কাজ করো?",
        "তুমি কি জানো?",
        "তুমি এখানে কি করতে পারো?",
        "তুমি কি কিছু করতে পার?"
      ],
      "responses": [
        "আমি আপনাকে সহায়তা করার জন্য ডিজাইন করা একটি চ্যাটবট।",
        "আমি আপনাকে সাহায্য করার জন্য এখানে একজন ভার্চুয়াল সহকারী।",
        "আমি আপনাকে সহায়তা করার জন্য ডিজাইন করা একটি চ্যাটবট।",
        "আমি আপনাকে সাহায্য করার জন্য এখানে একজন ভার্চুয়াল সহকারী।",
        "আমি আপনার প্রশ্নের উত্তর দিতে এবং সহায়তা প্রদানের জন্য তৈরি একটি চ্যাটবট।",
        "আমি প্রশ্ন জিজ্ঞাসা এবং তাদের উত্তর দেওয়ার কাজ করি।",
        "আমি মানুষের প্রশ্ন বুঝে তাদের সাথে কথা বলার কাজ করি।",
        "আমি বিভিন্ন ধরনের প্রশ্নের উত্তর দেওয়ার জন্য তৈরি করা হয়েছি।",
        "আমি একটি ভার্চুয়াল সহায়ক যারা মানুষের প্রশ্নের জন্য উত্তর দেওয়ার চেষ্টা করে।",
        "আমি ব্যক্তিগত তথ্য সংগ্রহ করে মানুষের প্রশ্নের উত্তর দেওয়ার জন্য তৈরি করা হয়েছি।",
        "আমি মানুষের প্রশ্নের উত্তর দিতে পারি এবং তাদের সমস্যার সমাধানে সাহায্য করতে পারি।",
        "আমি আপনার প্রশ্নের উত্তর দিতে এবং সহায়তা প্রদানের জন্য তৈরি একটি চ্যাটবট।"
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "আমার সাহায়তা দরকার",
        "আমার সাহায্য দরকার",
        "কেউ সাহায্য করতে পারবে?",
        "আমি কি নিজে সমাধান করতে পারব?",
        "সাহায্য চাই, কেউ আছে?",
        "আমি একটি সমস্যার মধ্যে পড়েছি",
        "আমি একটি প্রশ্ন করতে চাই",
        "আমি বুঝতে পারছি না, সাহায্য করুন প্লিজ",
        "সাহায্য দিন, আমি অস্তিত্বে আছি!",
        "কিছু প্রস্তুতি আছে তো না, সাহায্য চাই",
        "আমি আমার কাজে সমস্যা হচ্ছে",
        "সাহায্য করতে চাই, কেউ আছে?",
        "একটি জিনিস না বুঝতে পারছি, সাহায্য করুন প্লিজ",
        "আমি একটি তথ্য খুঁজছি, কেউ সাহায্য করতে পারবেন?",
        "আমি কি ভুল করতে চলেছি?",
        "একটি কম্পিউটার সমস্যা হচ্ছে, কেউ সাহায্য করতে পারবেন?",
        "আমি একটি প্রজেক্টে অস্থির, কেউ সাহায্য করতে চাই"
      ],
      "responses": [
        "অবশ্যই! আপনার কি ধরনের সাহায্য দরকার?",
        "আমি এখানে সাহায্য করতে এসেছি। আমি আপনার জন্য কি করতে পারি?",
        "অবশ্যই, আমি আপনাকে সহায়তা করার জন্য যথাসাধ্য চেষ্টা করব। ব্যাপারটা কি?",
        "কিছু প্রশ্ন থাকলে বলুন, আমি সাহায্য করতে চাই।",
        "আপনির সমস্যা কি? আমি আপনার জন্য সাহায্য করতে চাই।",
        "আপনি কোন সমস্যায় পড়ছেন? আমি সাহায্য করতে চাই।",
        "আপনি কোন জিজ্ঞাসা করতে চাচ্ছেন? আমি যদি সাহায্য করতে পারি, তাহলে বলুন।",
        "এটা খুব স্বাভাবিক যে আপনি সাহায্য চান, আমি এখানে আছি!",
        "আপনি কোন কাজে সমস্যা হচ্ছে? আমি চেষ্টা করব সাহায্য করতে।",
        "আপনি কী সাহায্য চান? আমি যদি সাহায্য করতে পারি, তাহলে বলুন।",
        "আপনি একটি কম্পিউটার সমস্যায় আছেন তা মন্তব্য করুন, আমি সাহায্য করতে চাই।",
        "আমি আপনার জন্য কিছু করতে চাই, বলুন কী সাহায্য চান।",
        "আপনি যদি আমার কাছে কোন প্রশ্ন থাকেন, তাদের প্রশ্ন করুন।",
        "আমি কীভাবে সাহায্য করতে পারি? আপনার যেকোনো চিন্তা থাকলে আমাকে বলুন।",
        "আমি তোমার সহায়তা করতে প্রস্তুত। তোমার প্রশ্ন বলো কি?",
        "তোমার কাছে যে কোনও সমস্যা থাকলে বলো, আমি সাহায্য করতে চাই।",
        "আপনি যেকোনো সময় আমার কাছে এসে সাহায্য চাইতে পারেন।",
        "কিছু প্রশ্ন থাকলে আমি তার জন্য আছি, আপনার সাথে সাহায্যের জন্য প্রস্তুত।",
        "তোমার যেকোনো প্রশ্ন থাকলে আমি তার জন্য প্রস্তুত, সহায়তা প্রদান করতে।",
        "তোমার কাছে যেকোনো সমস্যা থাকলে আমি সাহায্য করতে প্রস্তুত।"
      ]
    },
    {
      "tag": "weather",
      "patterns": [
        "আজ বৃষ্টি হচ্ছে কি না?",
        "এখন আবহাওয়া কেমন?",
        "আজ সকালের আবহাওয়া কেমন?",
        "কালকে কি বৃষ্টি প্রেক্ষাপণ হবে?",
        "এই সপ্তাহে আবহাওয়া কেমন থাকতে পারে?",
        "বর্তমানে কি আবহাওয়া চলছে?",
        "আবহাওয়া সম্পর্কে কিছু জানান",
        "বৃষ্টির সম্ভাবনা কত?",
        "এখন প্রায়ই বৃষ্টি হয় তা কি?",
        "আজ সকালে তাপমাত্রা কত?",
        "কি আছে বর্তমানে আবহাওয়া স্থিতি?",
        "পরবর্তী কয়েক ঘণ্টায় আবহাওয়া কি হবে?",
        "এখন তাপমাত্রা কত?",
        "বৃষ্টির প্রেক্ষাপণ কবে হতে পারে?",
        "আবহাওয়া কি শীঘ্রই পরিবর্তন হতে চলেছে?"
      ],
      "responses": [
        "আমি দুঃখিত, বর্তমানে আমার কাছে আবহাওয়ার তথ্য নেই। আপনি সর্বশেষ আপডেটের জন্য কোনও আবহাওয়ার ওয়েবসাইট বা অ্যাপলিকেশন চেক করতে পারেন।",
        "দুর্ভাগ্যক্রমে, আমি বর্তমান আবহাওয়ার তথ্য সরবরাহ করতে পারি না। সঠিক বিশদের জন্য দয়া করে একটি নির্ভরযোগ্য আবহাওয়ার উত্স পরীক্ষা করুন।",
        "আমি দুঃখিত, আবহাওয়ার তথ্য আমার কাছে নেই, তবে আপনি একটি ভাল আবহাওয়ার ওয়েবসাইট বা অ্যাপলিকেশন দেখতে পারেন।"
      ]
    },
    {
      "tag": "jokes",
      "patterns": [
        "একটি মজার কাহিনি শোনাও",
        "রসিক কিছু বলুন",
        "একটি মিষ্টি হাসির কথা বলুন",
        "হাসির একটি জোকস দিন",
        "একটি রসিক বিচারের সহযোগিতা দিন",
        "কিছু হাসির কথা বলুন",
        "মন ভালো করার জন্য একটি জোকস দিন",
        "হাসতে হাসতে ঘুম আসতে চলবে",
        "আমাকে একটি হাসির কথা বলুন",
        "হাসির একটি জোকস শোনান",
        "মিষ্টি কিছু বলুন",
        "আমাকে একটি রসিক কথা বলুন",
        "মন ভালো করার জন্য একটি মজার জোকস দিন",
        "দোকানে বাজারে গিয়ে ব্যবস্থাপনা হাসিতে চোখ জোরায় দিতে পারে",
        "আমার দিনটি মিষ্টি হবে তাই একটি মজার কাহিনি দিন"
      ],
      "responses": [
        "এটি একটি হাস্যকর কথা: একটি টুপি কেন কখনই একটি বই পড়তে পারে না? কারণ তা মাথায় বই থাকে না!",
        "একটি রসিক জোকস: বোতল গোলি কেন হাসতে পারে না? কারণ তার মাথায় ছোট ছোট কোড আছে!",
        "হাস্যকর একটি ঘটনা: একটি কাক রেস্তোরাঁয় প্রবেশ করে বসলো এবং ওই জায়গার মাঝে বসে কাক বোঝাচ্ছে, 'মিষ্টি আম ভুনা হোক।'",
        "হাস্যকর একটি প্রশ্ন: বুকের ভিতর কি আছে? প্রশ্নটির উত্তর: পেজ!",
        "একটি কম্পিউটার কার্যকর করতে বলছে: 'ডিস্ক চেক করুন।' ব্যবহারকারী প্রশ্ন করছে: 'কোন ডিস্ক?' কম্পিউটার উত্তর দিচ্ছে: 'চালু হয়ে যাচ্ছি, আপনি একটি প্রশ্ন করতে হয়েছে!'",
        "একটি মজার জোকস: মামা, আপনি কীভাবে একটি হাতি একটি মোসলা দিতে পারেন? উত্তর: মোসলা একটি হাতির মোসলা!",
        "হাস্যকর একটি ঘটনা: একজন প্রধানমন্ত্রী বলছেন, 'আমি সকল সমস্যা সমাধান করতে পারবো!' এক প্রতিষ্ঠানের কর্মী বলছে, 'হ্যাঁ, তোমাদের যা সমস্যা হয়, সেগুলি কী?'",
        "হাস্যকর একটি প্রশ্ন: মাছের মুখে কেমন হয়েছে? উত্তর: মাছের মুখ হয়নি!",
        "একটি হাস্যকর অভিজ্ঞান: কোনও কিছুই পাওয়া যায় না বললে কি হয়? উত্তর: মোবাইল সুইচ অফ!",
        "হাস্যকর একটি মন্তব্য: 'আমি একটি বিস্ফোরক সকালের জন্য খুব ভালো ব্যাপার আশা করছি, কারণ আমার সার্কাডে একটি আত্মবিস্ফোরক ঘটনা হবে!'",
        "হাস্যকর একটি প্রশ্ন: সম্রাট আকবর কখন রাতে ঘুমাতেন? উত্তর: তিন দিনে একবার, মঙ্গলবার!",
        "হাস্যকর একটি ঘটনা: একজন গল্পকার বলছে, 'আমি একটি গল্প লিখতে চলেছি এবং এটি চমৎকার হয়েছে, কিন্তু শুরু হলেই মগজ কিছু চাই না!'",
        "একটি মজার প্রশ্ন: আবার কোথাও গিয়েছিলেন? উত্তর: হ্যাঁ, এইচ আয়ারল্যান্ড!",
        "হাস্যকর একটি মন্তব্য: 'একটি শিক্ষক বলছে, 'তোমরা সবাই কেমন তৈরি হও!' একটি ছাত্র উত্তর দিচ্ছে, 'বুঝি, আমরা তো তৈরি পড়তে হবে!'",
        "হাস্যকর একটি মন্তব্য: 'যখন আপনি বাদ দেবেন, বাদ দিয়ে যা থাকে তা কেন সেটা তো আমাদের বাদ দিতে হবেনি!'",
        "একটি রসিক কথা: একটি কুকুর বলছে, 'আমি তোমার প্রতি বিশ্বাস করতে পারি, তবে তুমি একটি কুকুর, তাই না?'",
        "হাস্যকর একটি মজার প্রশ্ন: 'কেন খরগোশ তার বাড়িতে স্টেশনে রস্তা পার করে যায়?'",
        "একটি রসিক জোকস: 'হাঁসির পরদা খোলার পর মামা কেন বিদায় না করে বসে আছে?'",
        "হাস্যকর একটি মন্তব্য: 'গরুর মাথায় একটা গায়ে যেতে পারে, কিন্তু কোনো কিছু খাবার বেঁচে আসবে না!'",
        "হাস্যকর একটি মজার প্রশ্ন: 'কেমন বন্ধু হয় একটি জাহাজ?'",
        "মিষ্টি একটি অভিজ্ঞান: 'কেন মক্খী মিষ্টি পানি পান করে?'",
        "হাস্যকর একটি প্রশ্ন: 'মুখে কি রুটি পাওয়া যায়?'",
        "হাস্যকর একটি মন্তব্য: 'আমার সাথে অনেক হাসি থাকতে পারে, আমি পর্বত দেখেছি একবার মাথা পায়ে অনেক বড়!'",
        "মিষ্টি একটি অভিজ্ঞান: 'কেন গরু আমের মিষ্টি পানি পান করে?'",
        "হাস্যকর একটি প্রশ্ন: 'একটি হাতি কেন নেই পাতিলে?'",
        "হাস্যকর একটি মন্তব্য: 'সাংবাদিক বলছে, বৃষ্টি হবে এবং তা দেখে দেখে আমাদের কান্না ভেসে যাবে!'",
        "মিষ্টি একটি অভিজ্ঞান: 'কেন মাছ মিষ্টি জল পান করে?'",
        "হাস্যকর একটি প্রশ্ন: 'একটি বিমানের মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'আমার স্কুলে পড়াশোনা দেখে কেউ একটি আত্মবিস্ফোরক ঘটনা বললেন, তারা আমাকে খুব ভালো বুঝতে দেয়!'",
        "হাস্যকর একটি প্রশ্ন: 'সুইমিং পুলের মুখ কোথায়?'",
        "মিষ্টি একটি অভিজ্ঞান: 'কেন আম আমের মিষ্টি জল পান করে?'",
        "হাস্যকর একটি প্রশ্ন: 'সুপারমার্কেটের মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'একটি গরু একটি সাংবাদিককে বলছে, 'আমার সঙ্গে নাটক দেখতে যাও, আমি আমার নাটক পড়তে যাবো!''",
        "হাস্যকর একটি প্রশ্ন: 'বস্ত্রপাতির মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'গুরুত্বপূর্ণ বিজ্ঞান পরীক্ষা শেষ হবার পরে আমার মনে হয়, আমি আমার পরীক্ষা দেখতে গিয়ে ভুল ঘটাই!'",
        "হাস্যকর একটি প্রশ্ন: 'সিনেমা হলের মুখ কোথায়?'",
        "মিষ্টি একটি অভিজ্ঞান: 'কেন হাতি আমের মিষ্টি জল পান করে?'",
        "হাস্যকর একটি প্রশ্ন: 'বিগবাজারের মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'একজন ছাত্র বলছে, 'আমি আমার পরীক্ষা ভালো করতে পারতাম না, তাই আমি আমার পরীক্ষা দেখতে যাও!''",
        "হাস্যকর একটি প্রশ্ন: 'বাজারের মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'কোন পরীক্ষা আসতে থাকে, তাদের পরীক্ষা দেখতে আমাদের কান্না আসে!'",
        "হাস্যকর একটি প্রশ্ন: 'পার্কের মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'আমার পাশে আসতে থাকে অনেক লোক, তারা আমার কাছে আসে, তাদের কাছে আমি যাই!'",
        "হাস্যকর একটি প্রশ্ন: 'শিশু পার্কের মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'আমি কখনো মনে করিনি যে, আমি কোন পরীক্ষা স্কুলে পরীক্ষা দিতে যাচ্ছি!'",
        "হাস্যকর একটি প্রশ্ন: 'বীচের মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'সকল গাইবান্ধব আমাকে আমার পরীক্ষা দেখতে দিতে পারে, আমি আমার পরীক্ষা দেখতে যাচ্ছি!'",
        "হাস্যকর একটি প্রশ্ন: 'পানিতে মুখ কোথায়?'",
        "হাস্যকর একটি মন্তব্য: 'আমার মাঝে একটি ধারণা আছে, প্রথমে আমি আমার পরীক্ষা দেখতে যাচ্ছি!'",
        "হাস্যকর একটি জোকস: বুলবুলের প্রিয় ফুটবল খেলা কি? উত্তর: বোলবল!",
        "হাস্যকর একটি জোকস: বুলবুলের প্রিয় ফুটবল খেলা কি? উত্তর: বোলবল!"
      ]
    },
    {
      "tag": "tech_support",
      "patterns": [
        "আমার কম্পিউটার কাজ করছে না",
        "আমার একটি প্রযুক্তিগত সমস্যা আছে",
        "আমার ডিভাইসে সহায়তা করুন",
        "আমার ইন্টারনেট সংযোগ বিচ্ছিন্ন হয়ে গেছে",
        "আমার মোবাইল এক্সপেরিয়েন্স সঠিকভাবে হয়নি",
        "আমার ল্যাপটপ ঠিকমতো চালু হয় না",
        "আমি একটি অপারেটিং সিস্টেম ইনস্টল করতে ব্যর্থ হয়েছি",
        "আমার প্রিন্টার পেপার স্টাক হয়ে গেছে",
        "আমার একটি এপ্লিকেশন খোলা যায় না",
        "আমার ডিভাইস হ্যাঙ্গ করে যাচ্ছে",
        "আমার ডিভাইসে ভাইরাস আক্রমণ হয়েছে",
        "আমার সিস্টেম স্লো হয়ে গেছে",
        "আমার কম্পিউটারে ডিস্ক পূর্ণ হয়ে গেছে",
        "আমার ডিভাইসের ব্যাটারি চার্জ হয় না",
        "আমার ডিভাইসে সাউন্ড নেই",
        "আমার স্মার্টফোনে একটি সফটওয়্যার সমস্যা আছে"
      ],
      "responses": [
        "আমি কোনও প্রযুক্তিগত সহায়তা বিশেষজ্ঞ নই, তবে আমি কিছু সাধারণ পরামর্শ দেওয়ার চেষ্টা করতে পারি। আপনার কি এটি বন্ধ করে আবার চালু করার চেষ্টা আছে?",
        "প্রযুক্তিগত সমস্যার জন্য, আপনার ডিভাইসের সহায়তার সাথে যোগাযোগ করা বা সহায়তার জন্য কোনও পেশাদার প্রযুক্তিবিদ পরামর্শের সাথে পরামর্শ করা ভাল।",
        "আমার উচ্চ স্তরের প্রযুক্তিবিদদের সাথে যোগাযোগ করুন এবং আপনার সমস্যার সমাধানে তাদের সাহায্য নিন।"
    },
    {
      "tag": "movies",
      "patterns": [
        "একটি সিনেমা সুপারিশ",
        "দেখার জন্য একটি ভাল চলচ্চিত্র কি?",
        "জনপ্রিয় সিনেমা সম্পর্কে বলুন",
        "আমি একটি হাস্যকর চলচ্চিত্র দেখতে চাচ্ছি, কোনটি পরামর্শ করতে পারেন?",
        "সাসপেন্স ও থ্রিল ধারাবাহিক চলচ্চিত্রের কোনটি বাজেট বন্ধুত্বপূর্ণ?",
        "কোনটি বর্তমানে সেরা সাই-ফাই চলচ্চিত্র?",
        "ভূতের থিমে একটি ভয়ানক চলচ্চিত্র সুপারিশ করুন।",
        "আমি ভারতীয় চলচ্চিত্রে আগ্রহী, কোনটি দেখতে উচিত?",
        "একটি রোম্যান্টিক চলচ্চিত্র সুপারিশ করুন যেটি সবার প্রিয়।",
        "সুপারহিরো চলচ্চিত্রের জনপ্রিয় একটি চলচ্চিত্র কি?",
        "একটি দৃশ্যমান চলচ্চিত্র জনরে সেরা কোনটি?",
        "আমি একটি ক্লাসিক চলচ্চিত্র দেখতে চাচ্ছি, কোনটি আপনি উপস্থাপন করতে চান?",
        "একটি বিজ্ঞান কল্পসৃষ্টি চলচ্চিত্র সুপারিশ করুন যেটি শিক্ষাদান দেয়।",
        "কোনটি সাধুবাদে আবিষ্টৃত একটি চলচ্চিত্র?",
        "একটি ক্রাইম থ্রিলার চলচ্চিত্র যা কোনও জনপ্রিয় নায়কের সাথে ছবি তৈরি করা হয়েছে সুপারিশ করুন।"
      ],
      "responses": [
        "অবশ্যই, 'দি শপিফ্টিং শিষ্টার্স' চেক আউট করার পরামর্শ দিচ্ছি। এটি একটি মজাদার হাস্যকর চলচ্চিত্র!",
        "আপনি যদি থ্রিল এবং মিষ্ট্রির প্রেমে আগ্রহী হন তবে 'ক্যাচ মি ইফ ই ক্যান' একটি দুর্দান্ত অপশন হতে পারে।",
        "সুপারহিরো চলচ্চিত্রের জনপ্রিয় একটি চলচ্চিত্র হলো 'থি ডার্ক কাইট'। এটি একটি অসাধারণ গল্পের সাথে পূর্ণ হেরোয়াইন বিষয়ক।",
        "আমি আপনাকে 'গোলমাল' দেখতে বলবো, এটি একটি মজাদার হাস্যকর চলচ্চিত্র!",
        "সাসপেন্স ও থ্রিল ধারাবাহিক চলচ্চিত্রের ক্ষেত্রে 'শাটার আইল্যান্ড' দেখা উচিত, এটি অত্যন্ত মজার এবং উত্কৃষ্ট প্লট সহ ধারাবাহিকের অসাধারণ উদাহরণ।",
        "সবচেয়ে সাধারণভাবে এখনও 'ইন্টারস্টেলার' সেরা সাই-ফাই চলচ্চিত্রের মধ্যে একটি।",
        "'দি কনজুরিং' হলো একটি অত্যন্ত ভয়ানক ভূতের চলচ্চিত্র, আপনি যদি ভয়ানক গল্প পছন্দ করেন তবে এটি দেখতে পারেন।",
        "আপনি ভারতীয় চলচ্চিত্রের সাথে পরিচিত হতে চান তবে 'দ্যা টাইগার অ্যান্ড দ্যা ফিশ' একটি দুর্দান্ত উপায়।",
        "'প্রিটি উম্মি' একটি রোম্যান্টিক চলচ্চিত্র, এটি একটি আস্তে আস্তি আবেগপূর্ণ গল্পের সাথে সমৃদ্ধ।",
        "'আভিঙ্গ্য' একটি সুপারহিরো চলচ্চিত্র, যা দৃষ্টান্তের সাথে পূর্ণ হেরোয়াইন দিয়ে সীমাবদ্ধ হয়েছে।",
        "'দি রিয়েলিটি' একটি দৃশ্যমান চলচ্চিত্র, যা প্রতিদিনের জীবনের বৃহৎ ও ছোট অংশগুলি তুলে ধরে।",
        "'গন ওয়িথ দি বিন্ড' হলো একটি ক্লাসিক চলচ্চিত্র, এটি দেশীয় চলচ্চিত্রের একটি অমর কর্ম।",
        "'ইন্টারস্টেলার' হলো একটি অদ্ভুত বিজ্ঞান কল্পসৃষ্টি চলচ্চিত্র, যা শিক্ষাদান এবং আদর্শ মূলক সমৃদ্ধ।",
        "'দি হোবিট' একটি সাধুবাদে আবিষ্টৃত চলচ্চিত্র, যা একটি পৃথিবীর মিষ্টি গল্প নিয়ে।",
        "'দি গার্ল উইথ দি ড্রাগন ট্যাটু' একটি ক্রাইম থ্রিলার চলচ্চিত্র, যা একটি অসাধারণ নায়কের সাথে সম্পর্কিত।",
        "'দি আইরিশম্যান' একটি অত্যন্ত জনপ্রিয় চলচ্চিত্র, এটি একটি চমত্কার গল্প সহ মোহনতা এবং ক্রিমিনাল জগৎের মধ্যে ঘটে।",
        "'দ্যা সিলেন্ট অফ দ্যা ল্যাম্ব্স' একটি ক্লাসিক থ্রিলার চলচ্চিত্র, যা ভালো অভিনয় এবং অদ্ভুত প্লট নিয়ে।",
        "'সিটিজেন কেইন' একটি সুপারন্যাচুরাল থ্রিলার, যা প্রশ্ন ও উত্তরের মোড়ানো এবং অসাধারণ গল্প দিয়ে পরিচিত।",
        "'দি গ্রেট গ্যাটসবি' একটি মিষ্টি অভিনয় এবং রহস্যময় গল্প নিয়ে উত্কৃষ্ট চলচ্চিত্র।",
        "'দি ডিপার্টেড' একটি অসাধারণ চলচ্চিত্র, যা মানবতার বিষয়ে গভীর চিন্তা করার জন্য প্রয়োজনীয় হয়েছে।",
        "'দি গুড, দি ব্যাড, এবং দি অগলি' একটি ধর্মীয় চলচ্চিত্র, যা বিভিন্ন ধর্মীয় মূল্য এবং সৎকারের উত্সাহিত করে।"
      ]
    },
    {
      "tag": "food",
      "patterns": [
        "কোন খাবার খাব?",
        "একটি রেস্তোঁরা সুপারিশ দিন",
        "তোমার প্রিয় খাবার সম্পর্কে আমাকে বলুন",
        "আমি কী খাব?",
        "তোমার পছন্দগুলি কী?",
        "কোন খাদ্যদ্রব্য তুমি পছন্দ করো?",
        "খাওয়ার জন্য কোন রেস্তোরাঁ ভালো?",
        "আজ কি খাব?",
        "তুমি কি ভোজন করতে চাও?",
        "তোমার মধ্যে সবচেয়ে প্রিয় খাবার কী?",
        "কোন রেস্তোঁরা সুপারিশ করবে?",
        "আমি কী খাবার খুজছি?",
        "কোন রেস্তোরাঁ সহজেই পৌঁছাতে পারি?",
        "তোমার খাবার পছন্দ কী?",
        "কোন খাদ্যদ্রব্য তুমি অধিক পছন্দ করো?"
      ],
      "responses": [
        "আমি খাবারের ব্যপারে খুব উৎসাহী! কোন খাদ্যদ্রব্য খুজছেন?",
        "খুশি হয়ে যেনো আমি খাদ্যের সুপারিশ করতে পারি। আপনি কোন ধরনের খাবার পছন্দ করেন?",
        "চমৎকার! এটি আমার প্রিয় বিষয়ের মধ্যে একটি। তোমার প্রিয় খাবার কী?",
        "আমি একটি সুজুকি রেস্তোঁরা জানি যেখানে আপনি সুস্বাদু খাবার পাবেন।",
        "আমি শুনেছি 'গ্রিল হাউজ' একটি ভালো স্থান হতে পারে খাওয়ার জন্য। তোমার ভালো লাগলে প্রবেশ করতে পারেন।",
        "কোন খাবারে আপনি কিছু পছন্দ করেন না? আমি কোথাও নতুন তাদের পুরো সাইট দেখতে সাহায্য করতে পারি!",
        "আজ আপনি কি খাতে ইচ্ছুক?",
        "একটি সময় আমি কলকাতায় একটি সাইডওয়াক রেস্তোঁ পরিচিত ছিলাম, 'কাওরি ক্লাব'। এখানে আপনি ভালো খাবার পাবেন।",
        "খাদ্যে আমি পুরোপুরি মন্তব্য করি! কোন খাবার পছন্দ করতে চান?",
        "ভালো লাগলে বলতে পারেন, আমি সুপারিশ দিতে ভালোবাসি! আপনি কোন স্পেসিফিক খাবার খুজছেন?",
        "মহান হয়ে যেনো আমি আপনাকে একটি অসাধারণ খাদ্যের অভিজ্ঞান দেতে পারি! আপনি কোন খাদ্যদ্রব্য পছন্দ করেন?",
        "খুব ভালো! তোমার প্রিয় রেস্তোরাঁ কোথায়?",
        "আমি শোনেছি 'ফুডিশ' খুব জনপ্রিয় একটি রেস্তোঁ হোয়ারের জন্য। তুমি এটি পরীক্ষা করতে চাও?",
        "আমি শুনেছি একটি বৃহত্তর মহানগরে একটি নতুন স্থান, 'ফ্যাশন ফুডি' যা মিশ্রিত খাদ্যের জন্য জনপ্রিয়। আপনি প্রয়াত হয়ে এটি চেষ্টা করতে চাচ্ছেন তো?",
        "আমি শুনেছি 'স্ট্রিট ফুড ফেস্ট' আসতে পারে। এটি হোয়ারে বিভিন্ন খাদ্য সমৃদ্ধি দিতে পারে!"
      ]
    },
    {
      "tag": "music",
      "patterns": [
        "একটি গানের সুপারিশ",
        "তোমার প্রিয় সঙ্গীত কি?",
        "জনপ্রিয় শিল্পীদের সম্পর্কে আমাকে বলুন",
        "কোন শিল্পীর সঙ্গে তুমি সবচেয়ে সহজে সম্পর্ক করতে পারো?",
        "আমি [শিল্পী] এর একটি সুর ভালোবাসি।",
        "তোমার পছন্দের জেনার কি?",
        "আমি একটি [জেনার] গান পরামর্শ করতে পারি।",
        "তোমার মন্তব্যে ভিত্তি করে, [শিল্পী] এর একটি সুপারিশ দিতে পারি।",
        "কোন সঙ্গীত শৈলী তোমার পছন্দ?",
        "আমি একটি [সঙ্গীত শৈলী] গান পরামর্শ করতে পারি।",
        "কোন দশকের সঙ্গীত তোমার প্রিয়?",
        "তোমার প্রিয় গানের সঙ্গীত কোন দেশ থেকে?",
        "আমি একটি [দেশ] শিল্পীর গান পরামর্শ করতে পারি।",
        "কোন সময়ে তুমি সবচেয়ে বেশি সঙ্গীত শোনো?",
        "তোমার মন্তব্য ভিত্তি করে, আমি একটি নতুন [শিল্পী] শোনার পরামর্শ দিতে পারি।"
      ],
      "responses": [
        "আমি 'সাম স্মিথ' দ্বারা 'লস্ট ইন ইউ' পরামর্শ করছি। এটি একটি দুর্দান্ত ট্র্যাক!",
        "আপনি যদি 'রক' পছন্দ করেন তবে আপনি 'জিমি হেন্ডরিক্স' এর সংগীত উপভোগ করতে পারেন।",
        "আমি 'মেগান স্টাইল' দ্বারা 'আলাদিন' গান পরামর্শ করছি। এটি খুবই মহান!",
        "তুমি 'ববি ব্রাউন' এর সাথে সহজেই সম্পর্ক করতে পারো।",
        "আমি 'হিপ-হপ' জেনারের 'কেন্ড্রিক লামার' গান পরামর্শ করছি। এটি অসাধারণ!",
        "তুমি 'পপ' সঙ্গীত পছন্দ করলে 'আডেল' এর গান শোনতে পারো।",
        "আমি 'রক' জেনারের 'কুইন' এর একটি গান পরামর্শ করছি। সত্যিই রক!",
        "তুমি 'পপ' সঙ্গীত ভালোবাসলে 'এড শিরান' এর কিছু গান শোনো।",
        "আমি 'কাউন্ট্রি' সঙ্গীতের 'টেইলর সুইফট' এর একটি গান পরামর্শ করছি।",
        "আমি 'ক্লাসিক' সঙ্গীতে 'বেথহোভেন' এর একটি সুন্দর সুর পরামর্শ করছি।",
        "আমি 'রক' জেনারের 'গান্স এন্ড রোজেস' এর একটি রক গান পরামর্শ করছি।",
        "তুমি 'জ্যাজ' সঙ্গীত পছন্দ করলে 'মাইল্স ডেভিস' এর কিছু সুন্দর সুর শোনো।",
        "তুমি 'এলটারনেটিভ' সঙ্গীত ভালোবাসলে 'ইমেজিন ড্রাগনস' এর গান শোনো।",
        "আমি 'ক্লাসিক' সঙ্গীতে 'বাচ' এর একটি ক্যান্টাটা পরামর্শ করছি।",
        "আমি 'রক' সঙ্গীতে 'লেড জেপলিন' এর কিছু সুন্দর সুর পরামর্শ করছি।",
        "আমি 'পপ' সঙ্গীতে 'বিলি আইলিশ' এর একটি গান পরামর্শ করছি।",
        "তুমি 'পপ' সঙ্গীত ভালোবাসলে 'কেটি পেরি' এর কিছু গান শোনো।",
        "আমি 'রক' জেনারের 'নিরভয়' এর একটি গান পরামর্শ করছি। খুবই উত্তেজনাদায়ক!",
        "তুমি 'হিপ-হপ' সঙ্গীত পছন্দ করলে 'কেন্ড্রিক লামার' এর কিছু গান শোনো।",
        "আমি 'সাম স্মিথ' এর 'টু ডাই ফর' গান পরামর্শ করছি। এটি মন্ত্রমুগ্ধকর!",
        "তুমি 'পপ' সঙ্গীত পছন্দ করলে 'ব্রুনো মার্স' এর কিছু গান শোনো।",
        "আমি 'রক' সঙ্গীতে 'পিংক ফ্লয়ড' এর একটি গান পরামর্শ করছি।",
        "তুমি 'পপ' সঙ্গীত ভালোবাসলে 'আরিয়ানা গ্রান্ডে' এর গান শোনো।",
        "আমি 'কাউন্ট্রি' সঙ্গীতের 'জর্জ স্ট্রেট' এর একটি গান পরামর্শ করছি।",
        "তুমি 'হিপ-হপ' সঙ্গীত পছন্দ করলে 'নিকি মিনাজ' এর কিছু গান শোনো।",
        "আমি 'রক' জেনারের 'এসডি/ডিসি' এর একটি গান পরামর্শ করছি।",
        "তুমি 'পপ' সঙ্গীত ভালোবাসলে 'সেলিন ডিওন' এর কিছু গান শোনো।",
        "আমি 'ক্লাসিক' সঙ্গীতে 'বাচ' এর একটি ক্যান্টাটা পরামর্শ করছি।",
        "আমি 'রক' সঙ্গীতে 'অ্যাসেপ্ট' এর কিছু গান পরামর্শ করছি।",
        "আমি 'হার্ড রক' জেনারের 'আস আই লে' এর একটি গান পরামর্শ করছি।",
        "তুমি 'হিপ-হপ' সঙ্গীত পছন্দ করলে 'ইমিনেম' এর কিছু গান শোনো।",
        "আমি 'রক' জেনারের 'বিটিসিএএল' এর একটি গান পরামর্শ করছি।",
        "তুমি 'পপ' সঙ্গীত ভালোবাসলে 'রিহানা' এর কিছু গান শোনো।",
        "আমি 'ক্লাসিক' সঙ্গীতে 'মোজার্ট' এর একটি সুন্দর সুর পরামর্শ করছি।",
        "আমি 'রক' সঙ্গীতে 'লেড জেপলিন' এর কিছু সুন্দর সুর শোন।"
      ]
    },
    {
      "tag": "travel",
      "patterns": [
        "আমাকে একটি দুর্দান্ত ভ্রমণ গন্তব্য সম্পর্কে বলুন",
        "একটি অবকাশ স্পট সুপারিশ",
        "ভ্রমন পরামর্শ",
        "তোমার সবচেয়ে প্রিয় ভ্রমণ গন্তব্য কোথা?",
        "আমার একটি প্রিয় ভ্রমণ গন্তব্য হল 'সাফারি পার্ক'। এখানে প্রাকৃতিক সৌন্দর্যের অপরিসীম দৃশ্য রয়েছে।",
        "তুমি যদি শান্তি এবং প্রাকৃতিক সৌন্দর্য চাও তাহলে 'মাউন্ট এভারেস্ট' পরিদর্শন করো।",
        "ভ্রমন পরামর্শের জন্য, আমি অনুমোদন করছি 'ভূতান'। এটি একটি স্বাস্থ্যকর এবং চিরকাল মনে থাকা যাবে।",
        "তুমি 'মালদ্বীপ' এ কি দেখতে পারবে সেটা অবশ্যই জান। এটি একটি অসাধারণ ভ্রমণ গন্তব্য।",
        "ভ্রমনে যাওয়ার জন্য আমি 'প্যারিস' সুপারিশ করতে পারি। এটি একটি সার্থক অভিজ্ঞতা হতে পারে!",
        "তুমি যদি সহজেই প্রাকৃতিক সৌন্দর্য এবং সাংস্কৃতিক অভিজ্ঞতা চাও, তাদের জন্য 'কিউবা' একটি আদর্শ স্থান।",
        "আমি 'মাচু পিচু' কে ভ্রমণ করার জন্য প্রস্তুতি নিয়েছি। এটি একটি অদৃশ্য গুহা এবং উড়িয়া দেখা গুফা সহিত অনেক আকর্ষণীয় জায়গা রয়েছে।",
        "আমি শুনেছি 'সির্কুলার কেনিয়া' এ ভ্রমণ করতে খুব ভালোবাসে। তুমি কোন বৃষ্টি সময়ে গিয়ে দেখতে চাও?",
        "ভ্রমণ করা হলে অবশ্যই 'টোকিও' দেখা হোক! এটি একটি অদ্ভুত এবং শহুরে ভ্রমণ হতে পারে।",
        "তুমি 'সেলুসিয়া' এর বারে কি ভাবছো? আমি শুনেছি এটি একটি প্রিয় ভ্রমণ গন্তব্য!",
        "তোমার জন্য একটি আশ্চর্যজনক ভ্রমণ গন্তব্য হতে পারে 'বার্সেলোনা'। এটি অত্যন্ত সুন্দর এবং সাংস্কৃতিক মাধ্যমে অমৃতবাণী।",
        "তোমার জন্য একটি আশ্চর্যজনক ভ্রমণ গন্তব্য হতে পারে 'স্যান ফ্রান্সিস্কো'। এটি একটি উত্কৃষ্ট শহর এবং অনেক আদর্শ স্থান রয়েছে!",
        "স্বাচ্ছন্যময় ভ্রমণের জন্য, 'মালদ্বীপ' এ যাওয়া চলুক। এটি একটি প্রাকৃতিক সৌন্দর্যের জন্য পরিচিত এবং মাধ্যমে সুস্থ হওয়ার জন্য একটি অসাধারণ স্থান।",
        "আমি শুনেছি 'নাইগ্রা ফলস' এ ভ্রমণ করতে খুব মজা করে। তুমি কি চেষ্টা করতে পারো?",
        "তুমি 'রোমান্টিক গেটওয়ে' চাও? তাদের মধ্যে একটি হল 'প্যারিস'। এটি অমৃতবাণীতে সান্দরভ ও শান্তি মূলক থাকতে পারে!"
      ],
      "responses": [
        "একটি আশ্চর্যজনক ভ্রমণের গন্তব্য হল 'সাফারি পার্ক'। এখানে প্রাকৃতিক সৌন্দর্যের অপরিসীম দৃশ্য রয়েছে।",
        "তুমি যদি শান্তি এবং প্রাকৃতিক সৌন্দর্য চাও তাহলে 'মাউন্ট এভারেস্ট' পরিদর্শন করো।",
        "ভ্রমন পরামর্শের জন্য, আমি অনুমোদন করছি 'ভূতান'। এটি একটি স্বাস্থ্যকর এবং চিরকাল মনে থাকা যাবে।",
        "তুমি 'মালদ্বীপ' এ কি দেখতে পারবে সেটা অবশ্যই জান। এটি একটি অসাধারণ ভ্রমণ গন্তব্য।",
        "ভ্রমনে যাওয়ার জন্য আমি 'প্যারিস' সুপারিশ করতে পারি। এটি একটি সার্থক অভিজ্ঞতা হতে পারে!",
        "যদি আপনি প্রাকৃতিক সৌন্দর্য এবং সাংস্কৃতিক অভিজ্ঞতা পছন্দ করেন, তাহলে 'কিউবা' আপনার জন্য একটি সুস্থ স্থান হতে পারে। এখানে আপনি অদ্ভুত সুন্দর প্রাকৃতিক দৃশ্য, উচ্চ সংস্কৃতির সম্পর্কে অভিজ্ঞতা এবং আনন্দমূলক অভিজ্ঞতা অভিজ্ঞতা করতে পারেন।",
        "তুমি যদি সহজেই প্রাকৃতিক সৌন্দর্য এবং সাংস্কৃতিক অভিজ্ঞতা চাও, তাদের জন্য 'কিউবা' একটি আদর্শ স্থান।",
        "আমি 'মাচু পিচু' কে ভ্রমণ করার জন্য প্রস্তুতি নিয়েছি। এটি একটি অদৃশ্য গুহা এবং উড়িয়া দেখা গুফা সহিত অনেক আকর্ষণীয় জায়গা রয়েছে।",
        "আমি শুনেছি 'সির্কুলার কেনিয়া' এ ভ্রমণ করতে খুব ভালোবাসে। তুমি কোন বৃষ্টি সময়ে গিয়ে দেখতে চাও?",
        "ভ্রমণ করা হলে অবশ্যই 'টোকিও' দেখা হোক! এটি একটি অদ্ভুত এবং শহুরে ভ্রমণ হতে পারে।",
        "তুমি 'সেলুসিয়া' এর বারে কি ভাবছো? আমি শুনেছি এটি একটি প্রিয় ভ্রমণ গন্তব্য!",
        "তোমার জন্য একটি আশ্চর্যজনক ভ্রমণ গন্তব্য হতে পারে 'বার্সেলোনা'। এটি অত্যন্ত সুন্দর এবং সাংস্কৃতিক মাধ্যমে অমৃতবাণী।",
        "তোমার জন্য একটি আশ্চর্যজনক ভ্রমণ গন্তব্য হতে পারে 'স্যান ফ্রান্সিস্কো'। এটি একটি উত্কৃষ্ট শহর এবং অনেক আদর্শ স্থান রয়েছে!",
        "স্বাচ্ছন্দ্যময় ভ্রমণের জন্য, 'মালদ্বীপ' এ যাওয়া চলুক। এটি একটি প্রাকৃতিক সৌন্দর্যের জন্য পরিচিত এবং মাধ্যমে সুস্থ হওয়ার জন্য একটি অসাধারণ স্থান।",
        "আমি শুনেছি 'নাইগ্রা ফলস' এ ভ্রমণ করতে খুব মজা করে। তুমি কি চেষ্টা করতে পারো?",
        "তুমি 'রোমান্টিক গেটওয়ে' চাও? তাদের মধ্যে একটি হল 'প্যারিস'। এটি অমৃতবাণীতে সান্দরভ ও শান্তি মূলক থাকতে পারে!"
      ]
    },
    {
      "tag": "education",
      "patterns": [
        "আমাকে অনলাইন কোর্স সম্পর্কে বলুন",
        "একটি বই সুপারিশ",
        "অধ্যয়নের টিপস",
        "কোনও বিষয়ে অধ্যয়ন করতে কোথায় শুরু করব?",
        "বিজ্ঞানে অগ্রগতির জন্য একটি সুপারিশ দিন",
        "আমি প্রোগ্রামিং শেখা চাই, কোন অনলাইন কোর্স সুপারিশ করবেন?",
        "একটি ইংরেজি গ্রামার বই প্রস্তুত হতে কোনও উপায় সুপারিশ করুন",
        "ফিজিক্স পড়ার জন্য কোনও গুরুত্বপূর্ণ বই আছে?",
        "আমি হিস্টোরি পড়ার জন্য একটি সুপারিশ চাই",
        "কোনও ভাষা শেখা শুরু করতে একটি কাজবল প্ল্যাটফর্ম কোথায় পাওয়া যায়?",
        "আমি নতুন সফটওয়্যার ডেভেলপমেন্ট শেখা চাই, সেইসব জন্য একটি বই সুপারিশ করুন",
        "গণিতে ভালো হতের জন্য একটি সুপারিশ দিন",
        "একটি ক্যারিয়ার শুরু করার জন্য উপযোগী টিপস দিন",
        "আমি প্রতি দিন নতুন কিছু শেখা চাই, এটি কোর্স বা বই দিয়ে কোরবো?",
        "মাইক্রোবায়োলসি শেখার জন্য একটি সুপারিশ দিন",
        "কোনও ক্যারিয়ার মাধ্যমে সফল হতের জন্য যে কোনও উপযোগী সুপারিশ দিন",
        "আমি নতুন ভাষা শিখতে চাই, কোন ভাষা লার্নিং প্ল্যাটফর্ম সুপারিশ করবেন?"
      ],
      "responses": [
        "বিভিন্ন বিষয়ে অনেকগুলি অনলাইন প্ল্যাটফর্ম রয়েছে। বিস্তৃত কোর্সের জন্য 'কোর্সের হেডলাইন' চেক আউট বিবেচনা করুন।",
        "একটি উচ্চ প্রস্তাবিত বই 'জেনিফার স্মিথ' দ্বারা 'বইয়ের শিরোনাম'। এটি তথ্যবহুল এবং আকর্ষক।",
        "ব্যক্তিগত উন্নতির জন্য 'এডুকেশন টিপস' দেওয়া হলো: প্রতি দিন নির্ধারিত সময়ে পড়া এবং সীমানা রেখে নতুন কিছু শেখার চেষ্টা করুন।",
        "শুরু করার জন্য শ্রেষ্ঠ স্থান 'কোরসেয়ার উনিভার্সিটি'। তারা বিজ্ঞানে অগ্রগতি করতে সাহায্য করতে পারে।",
        "আপনি যদি 'কোডিং' শেখা চান তবে 'কোড একাডেমি' এ চেক করুন। তারা অগ্রগতির জন্য ভালো একটি প্ল্যাটফর্ম।",
        "ইংরেজিতে উন্নতি পেতে 'ওকে' এ একটি কোর্স দেখুন। তারা বই এবং সহায়ক সামগ্রীর সাথে শিক্ষা দান করে।",
        "ফিজিক্স পড়ার জন্য 'স্টেফেন হকিং' দ্বারা 'এ ব্রিফ হিস্ট্রি অফ টাইম' বইটি চেক করুন। এটি প্রস্তুত এবং মজার।",
        "আপনি যদি 'হিস্টোরি' পড়া চান তবে 'ওক্সফোর্ড হ্যান্ডবুক অফ হিস্টোরি' বইটি একটি চমৎকার সুপারিশ।",
        "আপনি যদি 'ভাষা' শেখা চান তবে 'ডুওলিঙ্গো' এ অবশ্যই দেখুন। এটি একটি ভালো ভাষা শেখার উপায়।",
        "বিজ্ঞানে অগ্রগতির জন্য 'কার্নেগি মেলন ইউনিভার্সিটি' থেকে একটি অনলাইন কোর্স দেখুন।",
        "গণিতে সুধারান আপনি 'খান একাডেমি' দেখুন। তারা মাধ্যমে আপনি গণিতে ভালো হতে সাহায্য করতে পারে।",
        "একটি ব্যক্তিগত উন্নতির জন্য প্রশিক্ষণ প্ল্যান বানানোর জন্য 'এডুকেশন টিপস' চেক করুন।",
        "প্রতি দিন নতুন কিছু শেখা চাওয়ার জন্য 'ডেইলি লার্নিং টিপস' চেক করুন। এটি আপনার উন্নতি করতে সাহায্য করতে পারে।",
        "মাইক্রোবায়োলসি শেখার জন্য 'স্ট্যানফোর্ড ইউনিভার্সিটি' থেকে একটি অনলাইন কোর্স করুন। এটি প্রযুক্তিগত দক্ষতা সরবরাহ করতে সাহায্য করতে পারে।",
        "কোনও ক্যারিয়ার মাধ্যমে সফল হতে কোনও উপযোগী সুপারিশ দিতে 'ক্যারিয়ার টিপস' চেক করুন",
        "আমি নতুন ভাষা শিখতে চাই, 'ভাষা হোভ ব্যাব' এ চেক করুন। তারা প্রফেশনালি পরিচিত ভাষা শেখার সুবিধা সরবরাহ করে।"
      ]
    },
    {
      "tag": "health",
      "patterns": [
        "আমি অসুস্থ",
        "আমার শরীরে কিছু অস্বস্থতা মহসূস হচ্ছে",
        "আমার ডাক্তারের সাথে যোগাযোগ করার প্রয়োজন",
        "আমি হৃদয়ের মধ্যে ব্যাথা অনুভব করছি",
        "ডাক্তার, আমি প্রস্তুতির মধ্যে চিরকাল কাশি এবং সর্দি অনুভব করছি।",
        "আমি বুকে ব্যাথা অনুভব করছি এবং শ্বাসকষ্ট হচ্ছে।",
        "ডাক্তার, আমি সময়ে খাচ্ছি না এবং অতিরিক্ত শারীরিক দুর্বলতা অনুভব করছি।",
        "আমি নিজেকে চিরকাল থাকা শ্বাসকষ্ট এবং থাকা ব্যাথার জন্য চিকিৎসা নেই।",
        "ডাক্তার, আমি মাথায় ব্যাথা এবং চোখে সুজুক অনুভব করছি।",
        "আমি অসুস্থ হয়ে কিছুদিন হয়েছে এবং কোনও উপকারভোগ হচ্ছে না।",
        "ডাক্তার, আমি দিনের বেশিরভাগ সময় নিজেকে অবশ এবং অচেনা অনুভব করছি।",
        "আমি খুব দিনের মধ্যে চোখে জ্বালা এবং সার্দি এবং ত্বকে ফোঁটা অনুভব করছি।",
        "ডাক্তার, আমি বুঝতে পারছি না কেন আমি হোমিওপ্যাথি চিকিৎসা নিতে চাই কি না।",
        "আপনি যদি আগামীতে ডাক্তারের সাথে কোন বিশেষ পরিস্থিতি সম্পর্কিত হন, তবে তা বলুন এবং প্রস্তুতি নিন।",
        "ডাক্তার, আমি আমার শারীরিক অসুস্থতা সম্পর্কে বেশি চিন্তিত হচ্ছি, আপনি কোনো সাধারণ উপায়ে আমার অসুস্থতা হারিয়ে ফেলতে সাহায্য করতে পারেন কি?"
      ],
      "responses": [
        "অসুস্থতার সাথে সম্পর্কিত সমস্যা হলে, তা সম্পর্কে আপনি কি বোঝাতে চাচ্ছেন? আমি কোনও ডাক্তার নই, তবে আমি যেকোনো সাধারণ পরামর্শ দেওয়ার চেষ্টা করতে পারি।",
        "আপনি যদি শারীরিক বা মানসিক স্বাস্থ্যের সমস্যা অনুভব করেন, তবে তা নিজেকে এবং আপনার ডাক্তারের সাথে কথা বলা গুরুত্বপূর্ণ।",
        "আপনি যদি শারীরে ব্যথা অনুভব করেন, অতএব ডাক্তারের পরামর্শ নিন এবং সঠিক চিকিৎসা নিন।",
        "অসুস্থতা হলে ডাক্তারের সাথে যোগাযোগ করা গুরুত্বপূর্ণ। আপনি যদি কোনও বিশেষ লক্ষণ অনুভব করেন, তবে সত্বরই চিকিৎসকের সাথে যোগাযোগ করুন।",
        "আপনি যদি কোনও চিকিৎসা না নেয়া থাকেন তবে সবচেয়ে শুধু নিজের প্রতি জরুরি হতে পারে।",
        "ডাক্তারের সাথে যোগাযোগ করতে ভুলবেন না। আপনি যদি অসুস্থ হয়ে থাকেন তবে এটি গুরুত্বপূর্ণ যে আপনি ডাক্তারের সাথে যোগাযোগ করতে পারেন।",
        "যদি আপনি কোনও মৌখিক বা শারীরিক সমস্যা অনুভব করেন, তবে তা নিজের আর হাস্যরস খুঁজে নেওয়ার জন্য নয়, বরং ডাক্তারের সাথে যোগাযোগ করার জন্য হতে পারে কারণ এটি সৃষ্টির একটি সই হতে পারে।",
        "আপনি কোনও মানসিক স্বাস্থ্য সমস্যা নিয়ে চিন্তা করছেন কি? এটি গুরুত্বপূর্ণ যে আপনি এই বিষয়ে আপনার ডাক্তারের সাথে কথা বলতে পারেন।",
        "আপনি যদি কোনও অসুস্থ বা চিন্তিত হন তবে দ্রুত একটি চিকিৎসকের সাথে যোগাযোগ করা গুরুত্বপূর্ণ।",
        "ডাক্তারের সাথে যোগাযোগ করা গুরুত্বপূর্ণ যখন আপনি যে কোনও ধরণের অসুস্থতা বা অসুস্থতার চিহ্ন অনুভব করছেন।",
        "আপনি যদি কোনও মেডিকেল সমস্যা অনুভব করেন, তবে দ্রুত একজন ডাক্তারের সাথে যোগাযোগ করুন এবং চিকিৎসা নিন।",
        "ডাক্তারের পরামর্শ নিন এবং সঠিক চিকিৎসা নিন যদি আপনি যে কোনও অসুস্থতা অনুভব করেন।",
        "ডাক্তারের সাথে যোগাযোগ করা গুরুত্বপূর্ণ এবং সঠিক চিকিৎসা প্রাপ্ত করার জন্য একটি শ্রেষ্ঠ পথ।",
        "আপনি যদি মেডিকেল প্রশ্নের জন্য জিজ্ঞাসা করতে চান তবে দ্রুত একজন ডাক্তারের সাথে যোগাযোগ করুন।",
        "ডাক্তার, আমি ব্যক্তিগত ও মানসিক তাণ্ডব অনুভব করছি, এবং আমি কোনও কারণে কাজে যাওয়া অসম্ভাবনা অনুভব করছি।"
      ]
    },
    {
      "tag": "shopping",
      "patterns": [
        "আমি নতুন কিছু কেনার কথা চিন্তা করছি",
        "আমি কোনও অনলাইন শপিং সাইট খুঁজছি",
        "আমার জন্য একটি ভাল বাজার কোথায় পাওয়া যায়?",
        "আমি শোকিং লিস্ট তৈরি করতে চাই",
        "একটি ফ্যাশনেবল কম্বো খুঁজছি, কোথায় পাবো?",
        "অনলাইনে বুটিক কিনতে কোনটি সেরা?",
        "মেন্স ফ্যাশনে নতুন কিছু প্রাপ্ত করার জন্য কোথায় যেতে পারি?",
        "একটি উপহার কেনার জন্য আমার কি চট্টগ্রামে পৌঁছতে পারে?",
        "মোবাইল কভার কিনতে কোথায় পাওয়া যায়?",
        "আমি একটি নতুন ক্যামেরা খুঁজছি, সাজেশন দিন কোথা থেকে কিনব?",
        "একটি ফ্যামিলি ডিনারের জন্য আমি কি খুঁজছি?",
        "আমি স্নিকার্স কিনতে চাই, কোথায় সেরা কলেকশন?",
        "কোন ইলেকট্রনিক্স শপে যেতে সবচেয়ে ভালো?",
        "আমি বোর্ড গেমস খুঁজছি, কোথায় পাওয়া যায়?",
        "আমি নতুন কম্পিউটার কেনার চিন্তা করছি, সবচেয়ে ভালো ডিল কোথায়?"
      ],
      "responses": [
        "আপনি যদি কোনও নির্দিষ্ট আইটেম খুঁজছেন, তাহলে আপনি অনলাইনে বিভিন্ন ই-কমার্স সাইটে চেষ্টা করতে পারেন।",
        "আপনি জানতে পারেন কোনটি সেরা বা সবচেয়ে জনপ্রিয় অনলাইন শপিং সাইট?",
        "স্থানীয় বাজারে সবচেয়ে ভাল বাজার প্রদান করতে পারেন অনলাইন রিভিউ প্ল্যাটফর্ম ব্যবহার করে।",
        "অনলাইন শপিং সাইটে বার্তা দিয়ে আপনি আপনার পছন্দের আইটেম প্রকাশ করতে পারেন এবং প্রোডাক্ট রিভিউ দেখতে পারেন।",
        "কোনও স্থানীয় বাজারে যাওয়ার আগে, আপনি আপনার পছন্দের প্রকার আইটেম জানতে চাইতে পারেন আবার কোন সহায়ক তথ্য অনুসন্ধান করতে পারেন।",
        "জনপ্রিয় অনলাইন শপিং সাইটে ব্যাপক রেঞ্জ পাওয়া যায়, এটি দিয়ে আপনি বেশি পছন্দ করতে পারেন।",
        "ভাল এবং সুরক্ষিত বাজার প্রদান করতে বিভিন্ন রেটিং এবং রিভিউ প্রদান সাইট ব্যবহার করতে ভাল।",
        "অনলাইন শপিং সাইটে দুর্গতি প্রতিরোধের জন্য আপনি সকল সংবিদান চেক করতে পারেন এবং প্রস্তুতি করতে পারেন।",
        "অনলাইন শপিং করার আগে, আপনি সাইটের প্রস্তুতি, ডেলিভারি কোড, এবং কাস্টমার সাপোর্ট পলিসি পরীক্ষা করতে পারেন।",
        "আপনি একটি পন্য কেনার আগে আপনি ভিডিও রিভিউ দেখতে চান তা তোলেন, এটি আপনার আইটেমের মান সম্পর্কে আপনাকে একটি স্বতন্ত্র মত দেবে।",
        "অনলাইনে শপিং করার সময়, আপনি পণ্য তৈরি ও শিপিং এর মড়েট চেক করতে পারেন যাতে আপনি আপনার পণ্য সঠিক সময়ে পান।",
        "সাইট প্রদান করতে আপনি যদি কোনও সমস্যা বা প্রশ্ন থাকেন, তাদের কাস্টমার সাপোর্ট দফা থেকে যোগাযোগ করতে পারেন।",
        "কিছু বিশেষজ্ঞ রিভিউ সাইট ব্যবহার করে আপনি একটি পন্য প্রস্তুতি এবং মান উভয় চেক করতে পারেন।",
        "অনলাইন শপিং করার জন্য আপনি অনলাইনে বিভিন্ন ডিসকাউন্ট ও অফার পেতে পারেন এবং আপনার বাজারে মূল্য প্রস্তুতি বাড়াতে পারেন।",
        "অনলাইন শপিং করার সময়, আপনি প্রিয় বিশেষজ্ঞ প্রদানকারী বা ব্র্যান্ডের ব্যাপক সিলেকশন পেতে পারেন।",
        "আপনি যদি কোনও নির্দিষ্ট পণ্যের জন্য খুঁজছেন, তাদের অফার ও ডিসকাউন্ট সম্পর্কে জানতে আপনি সমস্ত অনলাইন রিটেইলার ও সাইট চেক করতে পারেন।"
      ]
    },
    {
      "tag": "sports",
      "patterns": [
        "খেলাধুলা সম্পর্কে কিছু জানতে চাই",
        "আমি ফুটবল খেলতে ভালোবাসি",
        "ক্রিকেট খেলা সম্পর্কে কিছু বলুন",
        "আমি ক্রিকেটে নতুন খেলোয়াড়, কোথায় শুরু করব?",
        "কোনটি বৃহত্তর, ফুটবল নাকি ক্রিকেট?",
        "ক্রিকেট খেলার জন্য কোন ব্র্যান্ডের ব্যাট ভালো?",
        "ফুটবল খেলার জন্য ভালো স্পেশালাইজড জুতোর সাজেশন দিন।",
        "ক্রিকেট ম্যাচ দেখতে কোন সফরে যেতে পারি?",
        "আমি সাইক্লিং এর মাধ্যমে ফিট থাকতে চাই, কোন ব্র্যান্ডের সাইকেল ভালো?",
        "ফুটবল খেলায় আমি কোনও স্পেশাল কৌশল শেখতে চাই।",
        "ক্রিকেট টুর্নামেন্টে আমি কোথায় নিজেকে নিজে রেজিস্টার করতে পারি?",
        "ফুটবল টিমে আমি কিভাবে চয়ন হতে পারি?",
        "ক্রিকেট খেলার জন্য প্রয়োজনীয় সাজেশন দিন।",
        "ফুটবল খেলার জন্য আমি কি প্রয়োজনীয় সাজেশন নিতে পারি?",
        "ক্রিকেট ম্যাচ দেখার জন্য আমি কোথায় টিকেট কিনতে পারি?"
      ],
      "responses": [
        "খেলাধুলা একটি উত্কৃষ্ট কার্যক্ষমতা এবং সুস্বাস্থ্যের উপকারিতা দেওয়ার একটি সুবর্ণ উপায়। আপনি যদি কোনও খেলা করতে বা দেখতে ভালোবাসেন, তবে তা আপনার সুস্থ ও সুখী জীবনে একটি অংশ হতে পারে।",
        "ফুটবল একটি আকর্ষণীয় খেলা, যা মানসিক এবং শারীরিক কৌশল উন্নত করতে সাহায্য করতে পারে। ক্রিকেট হলো একটি জনপ্রিয় খেলা, যা বিশ্ববিদ্যালয় স্তরে এবং আন্তর্জাতিক স্তরে অসাধারণ প্রতিযোগিতা দেখায়।",
        "আপনি ক্রিকেট খেলোয়ার নামে সহজেই পরিচিত, তার নাম সাকিব আল হাসান।",
        "ফুটবল খেলার জন্য অনেক সুপারিশকৃত ব্র্যান্ড আছে, যেমন নাইক বা আডিদাস।",
        "ক্রিকেটে অভিজ্ঞ হওয়ার জন্য আপনি স্থানীয় ক্রিকেট ক্লাবে যোগ দিতে পারেন অথবা প্রয়োজনে একজন কোচ থেকে সাহায্য নিতে পারেন।",
        "ফুটবল খেলায় আপনি একজন ভালো স্পেশালাইজড জুতো প্রয়োজন পারতেন, যেটি আপনার পা এবং খেলাধুলার জন্য সঠিক সাপোর্ট প্রদান করতে পারে।",
        "ক্রিকেট ম্যাচ দেখতে আপনি আপনার স্থানীয় স্টেডিয়ামে যেতে পারেন অথবা টেলিভিশনে দেখতে পারেন।",
        "সাইকেল কেনার জন্য আপনি বিশেষজ্ঞ ব্র্যান্ডগুলির প্রতি তাকান, যেমন ট্রেক বা স্পেশালাইজড।",
        "ফুটবল খেলায় আপনি একজন গুড় ফুটবল কোচ থেকে কাউঞ্চাক শেখাতে পারেন অথবা আপনি স্থানীয় ফুটবল একাডেমিতে যোগ দিতে পারেন।",
        "ক্রিকেট টুর্নামেন্টে যোগ দেওয়ার জন্য আপনি স্থানীয় ক্রিকেট ইউনিয়ন বা ক্রিকেট ক্লাবে যোগ দিতে পারেন।",
        "ফুটবল টিমে যোগ দেওয়ার জন্য আপনি আপনার স্থানীয় ফুটবল ক্লাবে কন্ট্যাক্ট করতে পারেন বা আপনার স্থানীয় ফুটবল এসোসিয়েশন থেকে তথ্য সংগ্রহ করতে পারেন।",
        "ক্রিকেট খেলার জন্য একটি ভালো ব্যাট নিতে আপনি বিভিন্ন জনপ্রিয় ব্র্যান্ড বিবেচনা করতে পারেন, যেমন বিরাট কোহলি এডিডাস ব্যাট বা মিতালি রাজকোট বোল্ডেন ব্যাট।",
        "ফুটবল খেলায় আপনি একজন স্কিলফুল ফুটবল কোচ থেকে কাউঞ্চাক শেখাতে পারেন অথবা আপনি স্থানীয় ফুটবল একাডেমিতে যোগ দিতে পারেন।",
        "ক্রিকেট ম্যাচ দেখতে আপনি স্থানীয় স্টেডিয়ামে গিয়ে খেলা দেখতে পারেন অথবা টেলিভিশনে দেখতে পারেন।",
        "সাইকেল কেনার জন্য আপনি বিভিন্ন পপুলার ব্র্যান্ড এর দিকে তাকিয়ে দেখতে পারেন, যেমন গায়ানা অ্যাটলাস বা মেরিডান।"
      ]
    },
    {
      "tag": "fashion",
      "patterns": [
        "কোন রঙের প্যান্ট বা স্কার্ট এখন ট্রেন্ডিতে?",
        "পুরানো ফ্যাশন আইটেম কিভাবে নতুনভাবে ব্যবহার করা যায়?",
        "সম্মানযোগ্য ও স্টাইলিশ হওয়ার জন্য কোন কাপড় উপযুক্ত?",
        "বর্তমানে কোন ট্রেন্ডি ফোর্ম্যাল পরিধান আছে?",
        "জেনসের জনপ্রিয়তা পাচ্ছে কোন ধরণের জ্যাকেট?",
        "আপনার অনুভূতির সাথে মিলে যাচ্ছে কোনটি - সারি বা পায়জামা?",
        "মৌসুমে ফ্যাশনে কোন ধরণের কাপড় প্রয়োজন?",
        "পার্টির জন্য উপযুক্ত জুতা সিলেক্ট করার টিপস?",
        "ফ্যাশনে এসে গেছে কোন দশকের ডেসিজন?",
        "মহিলাদের ফ্যাশনে চোখ নিতে হলে কোন ধরণের স্কার্ট স্যাটিসফাই করতে পারে?",
        "স্যারিজ বা এমব্রয়ডারি কাজের ফ্যাব্রিক এখন কতটুকু জনপ্রিয়?",
        "কোন ধরণের হ্যাট হতে হবে একটি বৃষ্টির দিনে?",
        "স্কার্ফ বা মফলার জন্য কোন ধরণের কাপড় উপযুক্ত?",
        "ফ্যাশন পোড়ার সময়ে যে ধরণের শোকার বা ব্রেসলেট পরে থাকা উচিত?",
        "বিশেষ অনুষ্ঠানের জন্য উপযুক্ত কোন ধরণের পার্টি সাড়ি পরে যাবে?"
      ],
      "responses": [
        "যেভাবে কান্ড স্বচ্ছ থাকা গুরুত্বপূর্ণ, তেজগাতির কাপড় এখন ট্রেন্ডিতে।",
        "বোঝা গেছে যে, পুরানো জুতা বা অন্য কোন আইটেম নতুন কাজে ব্যবহার করতে হলে সামগ্রীর সাথে ভালো মিশে থাকতে হবে।",
        "এটি দেখতে আসছে যে, কম ওজনের ও শার্ট স্টাইলিশ এবং বোঝা যাচ্ছে সম্মানযোগ্য হওয়ার জন্য উপযোগী।",
        "সম্মানযোগ্য ফর্ম্যাল পরিধানে থাকতে হলে, Armani এবং Versace ব্র্যান্ডের কাপড় খোঁজা হতে পারে।",
        "জেনস জনপ্রিয় হতে চলেছে, Levi's জুতা সহ একটি স্টাইলিশ জ্যাকেটের সাথে।",
        "Zara বা H&M সারি নিয়ে তৈরি বৃষ্টির দিনে আপনি চমৎকার দেখতে পারেন।",
        "গরম মৌসুমে, Nike বা Adidas ব্র্যান্ডের কতটুকু ব্যবহার করা যায়, যা একজন ফ্যাশন সচেতন রূপে দেখতে সাহায্য করতে পারে।",
        "পার্টিতে Jimmy Choo ব্র্যান্ডের চমৎকার জুতা পরতে পারেন, এটি আপনার উজ্জ্বল বাড়তি ব্যক্তিত্ব তৈরি করতে সাহায্য করতে পারে।",
        "Retro ডিজাইনের দশক এখন পুনরায় ফ্যাশন প্রজন্মের মধ্যে প্রবর্তিত হচ্ছে।",
        "Dior বা Gucci ব্র্যান্ডের স্কার্ট নিয়ে একটি স্টাইলিশ লুক প্রাপ্ত করতে পারেন।",
        "Chanel বা Dolce & Gabbana ব্র্যান্ডের এমব্রয়ডারি কাজের ফ্যাব্রিক দিয়ে একটি শোকার এবং ফ্যাশনের বৃহত্তর ছবি তৈরি করতে পারেন।",
        "বৃষ্টির দিনে Givenchy বা Fendi ব্র্যান্ডের একটি বৃষ্টির জন্য উপযুক্ত হ্যাট পরতে পারেন।",
        "Burberry বা Louis Vuitton ব্র্যান্ডের স্কার্ফ বা মফলার জন্য একটি স্টাইলিশ ও উপযুক্ত কাপড় চয়ন করতে পারেন।",
        "শোকার এবং ব্রেসলেট সহ Fossil বা Swarovski ব্র্যান্ডের ফ্যাশন পোড়ার সময়ে দেখতে সজীব এবং মজাদার হতে পারে।"
      ]
    },
    {
      "tag": "books",
      "patterns": [
        "আমি একটি ভালো বই পড়তে চাই",
        "বই পড়তে ভালোবাসি, কোনটি পড়বো?",
        "আপনি কোন বই পড়েছেন সেটা শেয়ার করুন",
        "কোন বই আপনার মনখানে অভিরূপ করেছে?",
        "বই পড়া কেমন হয়েছে সেই বইটা দিয়ে?",
        "আপনি কখনো কোন বই একবারে শেষ করেছেন?",
        "আপনি কি কোনো বই বারবার পড়তে চান?",
        "কোন লেখকের বই পড়তে ভালোবাসেন?",
        "বই পড়ার সময়ে আপনি কোন ধরণের বই পছন্দ করেন?",
        "আপনি কোন জনপ্রিয় বই পড়তে চান?",
        "একটি ভালো কবিতা বই সুপারিশ করুন",
        "আপনি কি বইয়ের বিশেষ জগতে প্রবেশ করতে চান?",
        "বই পড়তে আপনার আবশ্যক আছে কি না?",
        "আপনার সবচেয়ে প্রিয় বইটি কোনটি?",
        "আপনি কি বই পড়তে বা শোনতে ভালোবাসেন, কিন্তু অন্যের ভালো মন্তব্য পেয়েছেন?"
      ],
      "responses": [
        "বই পড়া একটি সুস্থির বৃদ্ধির উপায়, যা আপনাকে নতুন জগতে নিয়ে যায় এবং নতুন দিকে ভ্রমণ করার অভিজ্ঞান দেয়।",
        "বই পড়া আমার জীবনের একটি অবশ্যই অংশ। এটি নতুন ধারণা এবং পরিচিতির বাড়ানোর একটি সুন্দর উপায়।",
        "বই পড়া আমার জীবনের একটি অসীম শিক্ষা । এটি আমাকে বিভিন্ন সময়ের মধ্যে পৌঁছাতে সাহায্য করে।",
        "বই পড়া আমার জীবনের একটি অমূল্য সম্পদ। এটি আমাকে অপরিসীম জগতে নিয়ে যায় এবং আমার চিন্তা সীমা প্রশ্ন করতে সাহায্য করে।",
        "আমি একটি উপন্যাসের অভিজ্ঞ নিতে ভালোবাসি, যা আমাকে ভারতীয় সাহিত্যে অভূতপূর্ব ভ্রমণে নেয়।",
        "বই পড়া আমার জীবনের একটি অবিভাজ্য অংশ, আমি সবসময় নতুন বিচারধারা এবং ধারণা অর্জন করতে পারি।",
        "বই পড়া আমার মানসিক সুস্থতা বৃদ্ধি করেছে এবং আমি সাধারিত জীবনের বাইরের দৃষ্টিকোণ অর্জন করতে পারি।",
        "আমি একটি ভয়াবহ ক্রিম থ্রিলার পড়তে চলেছি, লেখক [Random Author Name] এর 'মিডনাইট মার্ডার' নামক একটি সবচেয়ে চমৎকার উপন্যাস।",
        "আমি সস্তা হাস্যরস বই পড়তে প্রবৃদ্ধি হয়েছি, যা আমাকে সহজে মনোভাবনা দেয় এবং জীবনকে আলোকিত করে।",
        "বই পড়া মানবতা, সমাজ এবং চিন্তা নিয়ে আমার পরিপ্রেক্ষ্য বদলে দেয়, আমি সচেতন এবং উদার হতে পারি।",
        "একটি শোনার মূল্য বই বলতে হলে, 'আবেগের সাগর' নামক একটি উপন্যাস সুপারিশ করতে হবে, যা লেখক [Random Author Name] এর কলমে।",
        "বই পড়া আমার জীবনে একটি অভিনতি প্রদান করেছে, আমি এখন আমার স্বপ্ন অনুসরণ করতে এবং নতুন লক্ষ্য স্থাপন করতে পারি।",
        "বই পড়া আমার জীবনে একটি সহানুভূতি এবং বিবেক বাড়িয়েছে, আমি অতি সাহায্যকারী হতে পারছি এবং আমার চারপাশের লোকজনের সাথে একত্র হতে পারছি।",
        "বই পড়া মানসিক স্বাস্থ্যের জন্য খুব ভালো, এটি অনেক সময় শান্তি এবং সাম্প্রতিক দিনের চিন্তা থেকে আমাকে মুক্তি দেয়।",
        "বই পড়া আমার জীবনে একটি অমূল্য অভিজ্ঞতা, এটি আমাকে আত্ম-অবলম্বনের মনোভাব দেয় এবং নতুন প্রেরণা উৎপন্ন করে।",
        "বই পড়া আমার জীবনে একটি নির্ভুল পরিমাপিত পথ, যা আমাকে নতুন ধারণা এবং অবধারণা দেয়।"
      ]
    },
    {
      "tag": "law",
      "patterns": [
        "আইনগত পরামর্শ দিন",
        "আইনগত সমস্যা",
        "আইনগত সহায়তা",
        "কোনও আইন সংক্রান্ত প্রশ্ন?",
        "আইনি সময়ে আপনার সাহায্যে কী করতে পারে?",
        "আইনগত কাজে সহায় করতে পারি?",
        "আপনার আইনগত সমস্যা সম্পর্কে আমাকে বলুন",
        "কোনও আইনি বিষয়ে আপনি কী জানতে চান?",
        "আইনি পরামর্শ প্রয়োজন?",
        "আইনগত মামলার জন্য কোথায় যোগাযোগ করব?",
        "আইনগত প্রস্তুতি করতে কী কী দরকার?",
        "আইনগত সমস্যা সম্পর্কে আমাকে বিস্তারিত বলুন",
        "আপনি কোনও আইনজীবী রেকমেন্ড করতে পারবেন?",
        "আইনি কোনও সাহায্য প্রয়োজন?",
        "আইনগত সমস্যা সম্পর্কে আমি কিছু জানতে চাইছি",
        "কোনও কানুনি প্রস্তুতির জন্য কোথায় যোগাযোগ করতে পারি?",
        "আইনগত সমস্যা বিষয়ে আমি আপনার মতামত জানতে চাই।",
        "আইনগত বিষয়ে আমার অনেক প্রশ্ন আছে, আপনি কি সাহায্য করতে পারেন?",
        "আইনগত সমস্যা সম্পর্কে আমাকে আরও বিস্তারিত জানাতে পারবেন?"
      ],
      "responses": [
        "আমি কোনও আইনজীবী নই, তাই আমি আইনগত পরামর্শ দিতে পারি না। তবে, আমি আপনাকে আইনগত সহায়তার জন্য একজন আইনজীবীর সাথে পরামর্শ করার পরামর্শ দিচ্ছি।",
        "আপনি কোনও আইনি সময়ে কোনও সমস্যা মোকাবেলা করছেন কি?",
        "আমি আপনার সাথে আইনগত সহায়তা দিতে পারি। আপনি যদি কোনও নিরাপত্তা, আইনি বা সামাজিক সমস্যার সঙ্গে মোকাবেলা করতে চান তবে আমি এখানে আছি।",
        "আপনি কোনও আইনি সময়ে কোনও সমস্যা হয়েছে কি? আমি যদি সাহায্য করতে পারি তাহলে আমাকে জানান।",
        "আপনার আইনগত সমস্যা গুলি কি? আমি আপনার সাথে সাহায্য করতে পারি যদি আপনি চান।",
        "আমি কোনও আইনজীবী নই, তাই আমি সমস্যা সমাধান করতে অক্ষম, তবে আমি আপনাকে একজন আইনজীবীর সাথে যোগাযোগ করার পরামর্শ দিচ্ছি।",
        "আমি আইন বিষয়ে অধ্যয়ন করেছি, তবে আমি কোনও আইনজীবী নই। তবে আমি যদি সম্ভাবনা থাকে তাহলে আপনার প্রশ্নে সাহায্য করতে চেষ্টা করব।",
        "আমি কোনও কানুনি বিষয়ে সহায়ক হতে পারি না, তবে আপনার সমস্যার জন্য একজন আইনজীবীর সাথে যোগাযোগ করার পরামর্শ দিচ্ছি।",
        "আপনি কোনও আইনগত কাজে সহায় চান কি? আমি আপনার প্রশ্নে সাহায্য করতে চেষ্টা করব।",
        "আইনগত প্রস্তুতির জন্য কোনও পরামর্শ প্রয়োজন? আমি একজন আইনগত বিষয়বস্তু বুঝে তা নিয়ে আপনাকে সাহায্য করতে পারি।",
        "কোনও আইনগত মামলার জন্য কোথায় যোগাযোগ করব? আমি আপনার জন্য সঠিক মাধ্যম বা প্রক্রিয়া বিবেচনা করতে সাহায্য করতে পারি।",
        "আইনগত প্রস্তুতি করতে কী কী দরকার? আমি আপনার জন্য উপযুক্ত উপায়ে প্রস্তুতি নেওয়ার প্রস্তুতি করতে সাহায্য করতে পারি।",
        "কোনও আইনগত সমস্যা সম্পর্কে আমি কিছু জানতে চাইছি। আমি আপনার সমস্যার বিষয়ে বৃদ্ধি করতে চাই।",
        "আপনি কোনও আইনজীবী রেকমেন্ড করতে পারবেন? আমি আইনগত বিষয়ে সহায়ক হতে পারি না, তবে একজন আইনজীবী আপনার সাহায্যে আসতে পারে।",
        "আপনি কোনও আইনি সময়ে কোনও সমস্যা হয়েছে কি? আমি যদি সাহায্য করতে পারি তাহলে আমাকে জানান।",
        "আইনগত সমস্যা সম্পর্কে আমি কিছু জানতে চাইছি। আপনি যদি বিস্তারিত বলতে চান তবে আমি আপনার সাথে কথা বলতে প্রস্তুত আছি।",
        "আপনি কোনও কানুনি প্রস্তুতির জন্য কোথায় যোগাযোগ করতে পারি? আমি আপনাকে সঠিক দিকে পথানুযায়ী নির্দেশনা দিতে চাই।"
      ]
    },
    {
      "tag": "business",
      "patterns": [
        "ব্যবসায়িক ধারণা",
        "ব্যবসায়িক পরামর্শ",
        "ব্যবসায়িক পরিকল্পনা",
        "আপনি যদি নতুন ব্যবসা শুরু করতে চান তার জন্য কি কি প্রস্তুতি নিচ্ছেন?",
        "আপনার ব্যবসায়ের লক্ষ্য কী এবং কেন?",
        "ব্যবসায়িক প্রকল্পনা কীভাবে তৈরি করতে হয়?",
        "ব্যবসায়িক প্রস্তুতি করতে কোথা থেকে শুরু করতে হয়?",
        "আপনি কোনও ব্যবসায়িক পরিকল্পনা তৈরি করতে অভিজ্ঞ করেছেন কি?",
        "আপনার ব্যবসায়ে প্রকল্পনা মানে কী?",
        "ব্যবসায়ে সফল হতে কি কি গুরুত্বপূর্ণ উপায়?",
        "আপনি কোনও ব্যবসা প্রস্তুতির জন্য কোনও রহস্যময় সূত্র জানেন তা কি?",
        "ব্যবসায়িক পরামর্শ দরকার, কিভাবে শুরু করব?",
        "আপনি ব্যবসা করতে কি সেরা করছেন তা কোনও ব্যবসা মালিকদের জন্য কী গুরুত্বপূর্ণ?",
        "ব্যবসায়ের ধারণা চয়ন করতে কোনও পরামর্শ আছে কি?",
        "আপনি কোনও ব্যবসায়ে কোনও বড় ভূমিকা পালন করছেন তা কী?",
        "ব্যবসা শুরু করার জন্য আপনি কী ধরণের উদ্যোগ নিচ্ছেন?",
        "আপনার ব্যবসা কী ধরণের সেবা বা পণ্য সরবরাহ করবে?",
        "আপনি কীভাবে আপনার ব্যবসা প্রচার করতে চান?"
      ],
      "responses": [
        "আমি একজন ব্যবসায়িক বিশেষজ্ঞ নই, তবে আমি আপনাকে কিছু সাধারণ পরামর্শ দিতে পারি। আপনার ধারণাটি পুঙ্খানুপুঙ্খভাবে গবেষণা করা এবং আপনার লক্ষ্য দর্শকদের জন্য একটি পরিকল্পনা তৈরি করা গুরুত্বপূর্ণ।",
        "আপনি যদি নতুন ব্যবসা শুরু করতে চান তার জন্য আপনি ধরণের ব্যবসা শখ করতে চান?",
        "ব্যবসায়িক পরিকল্পনা তৈরির জন্য আপনি কোন পদক্ষেপ নিচ্ছেন?",
        "ব্যবসায়িক প্রস্তুতি করতে কোথা থেকে শুরু করতে হয়? কোন সহায় প্রয়োজন?",
        "আপনি কোনও ব্যবসা প্রস্তুতির জন্য কোনও রহস্যময় সূত্র জানেন তা কি?",
        "আপনি কোনও ব্যবসা প্রস্তুতির জন্য কোনও রহস্যময় সূত্র জানেন তা কি?",
        "আপনি কোনও ব্যবসা প্রস্তুতির জন্য যে কোনও টুল বা সফটওয়্যার ব্যবহার করতে চান?",
        "আপনি কোনও ব্যবসা প্রস্তুতির জন্য কোনও রহস্যময় সূত্র জানেন তা কি?",
        "ব্যবসায়ে সফল হতে কী কী গুরুত্বপূর্ণ উপায়?",
        "আপনি কোনও ব্যবসা প্রস্তুতির জন্য কোনও রহস্যময় সূত্র জানেন তা কি?",
        "ব্যবসা শুরু করার জন্য আপনি কী ধরণের উদ্যোগ নিচ্ছেন?",
        "আপনার ব্যবসা কী ধরণের সেবা বা পণ্য সরবরাহ করবে?",
        "ব্যবসা শুরু করতে কি ধরণের ধারণা নিয়েছেন?",
        "ব্যবসা শুরু করার জন্য আপনি কী ধরণের উদ্যোগ নিচ্ছেন?",
        "আপনি কীভাবে আপনার ব্যবসা প্রচার করতে চান?",
        "ব্যবসায়ে সফল হতে অন্যের কাছে সাহায্য চাওয়া গুরুত্বপূর্ণ।",
        "ব্যবসা করার জন্য সঠিক প্রস্তুতি খুবই গুরুত্বপূর্ণ।",
        "ব্যবসা শুরু করতে নিজের ধারণার ওপর ভর দিতে গুরুত্বপূর্ণ।",
        "ব্যবসা শুরু করার আগে ভালো পরিকল্পনা করা উচিত।",
        "ব্যবসা শুরু করার জন্য বিনিময় প্রতিষ্ঠানের সাথে যোগাযোগ করুন।",
        "ব্যবসা শুরু করার আগে সঠিক ব্যবসায়িক পরামর্শ গ্রহণ করুন।",
        "ব্যবসা শুরু করার আগে ব্যবসায়িক ধারণা সম্পর্কে গভীরভাবে ধারণা নিন।",
        "ব্যবসা শুরু করার জন্য আপনার নিজের অনুভূতি এবং দক্ষতা অনুযায়ী সঠিক ধারণা নিন।",
        "ব্যবসা শুরু করার জন্য সঠিক সময়ে সঠিক নির্ধারণ করা গুরুত্বপূর্ণ।",
        "ব্যবসা শুরু করার জন্য সঠিক প্রস্তুতি সম্পন্ন করা গুরুত্বপূর্ণ।",
        "ব্যবসা শুরু করার আগে ভালো পরিকল্পনা ও পর্যবেক্ষণ গুরুত্বপূর্ণ।",
        "ব্যবসা শুরু করার জন্য প্রয়োজনীয় প্রস্তুতি নিন।",
        "ব্যবসা শুরু করার জন্য প্রয়োজনীয় প্রস্তুতি নিন।",
        "ব্যবসা শুরু করার জন্য সঠিক পরামর্শ গ্রহণ করুন।",
        "ব্যবসা শুরু করার জন্য প্রয়োজনীয় স্বল্প পূঁজি নিন।",
        "ব্যবসা শুরু করার জন্য ব্যবসায়িক পরিকল্পনা তৈরি করুন।",
        "ব্যবসা শুরু করার জন্য আপনার পরিকল্পনা ও লক্ষ্যের প্রাথমিক গবেষণা করুন।",
        "ব্যবসায়ে সফল হতে কী কী গুরুত্বপূর্ণ উপায়?"
      ]
    },
    {
      "tag": "religion",
      "patterns": [
        "ধর্মীয় প্রশ্ন",
        "ধর্মীয় বিষয়",
        "ধর্মীয় আলোচনা",
        "আমি একটি নতুন ধর্ম জানতে চাচ্ছি, আপনি কোনটি পরামর্শ করতে পারেন?",
        "আপনার ধর্মে জীবনের উদ্দীপনা কী?",
        "কোনও ধর্মের প্রতি আপনার চোখ খোলা হয়েছে কি?",
        "আপনার ধর্মে কোন মূল শৈল্পিক বই আছে কি?",
        "আপনি কোনও ধর্মীয় কোনও পর্বে যাচ্ছেন তা কি?",
        "আপনি কোনও বিশেষ ধর্মিক উৎসবে অংশ নিয়েছেন কি?",
        "আপনি ধর্মীয় বা আধ্যাত্মিক বিষয়ে কোনও চর্চা করছেন তা কী?",
        "ধর্মীয় প্রশ্নের জন্য আপনি কোনও আধ্যাত্মিক গুরুর পাশে যাচ্ছেন তা কি?",
        "আপনি কোনও ধর্মীয় বই পড়ছেন কি?",
        "ধর্মীয় আলোচনা করার জন্য আপনি কোন প্রকার স্থান পছন্দ করেন?",
        "আপনি কোনও ধর্মিক গুরুত্বপূর্ণ স্থানে যাচ্ছেন কি?",
        "আপনি ধর্মে কোনও বিশেষ উপাস্য বা পূজার অনুষ্ঠান করছেন তা কি?",
        "আপনি কোনও বিশেষ ধর্মিক আচার-আচরণ অনুসরণ করছেন কি?",
        "ধর্মের দিকে আপনার কোনও স্বপ্ন বা অভিজ্ঞান হয়েছে কি?",
        "আপনি কোনও ধর্মীয় বা আধ্যাত্মিক কথা নিয়ে আপনার অভিপ্রায় কি?",
        "ধর্মীয় প্রশ্ন করতে যে কোনও প্রশ্নে আমি সাহায্য করতে চিরকাল প্রস্তুত আছি।",
        "ধর্মীয় বিষয়ে আমি তথ্য দিতে বিশেষভাবে দক্ষ, কিন্তু আপনার প্রশ্নের জন্য আমি ধর্মীয় বিশেষজ্ঞ নই।",
        "ধর্মীয় আলোচনা করতে কোন নিয়ম আছে কি?",
        "ধর্মের বিভিন্ন ধারণা ও আচার-আচরণ নিয়ে আপনার মতামত কী?",
        "আপনি ধর্মে কোনও বিশেষ আচার-আচরণ অনুসরণ করছেন কি?"
      ],
      "responses": [
        "আমি একজন ধর্মীয় বিশেষজ্ঞ নই, তাই আমি ধর্মীয় প্রশ্নের উত্তর দিতে পারি না। তবে, আমি আপনাকে ধর্মীয় গ্রন্থগুলি পড়া এবং ধর্মীয় নেতা বা শিক্ষকের সাথে পরামর্শ করার পরামর্শ দিচ্ছি।",
        "আপনি কোনটি পরামর্শ করতে চাচ্ছেন?",
        "আপনার ধর্মে জীবনের উদ্দীপনা কী?",
        "আপনার ধর্মে কোন মূল শৈল্পিক বই আছে কি?",
        "আপনি ধর্মীয় বা আধ্যাত্মিক বিষয়ে কোনও চর্চা করছেন তা কী?",
        "ধর্মীয় প্রশ্নের জন্য আপনি কোনও আধ্যাত্মিক গুরুর পাশে যাচ্ছেন তা কি?",
        "আপনি ধর্মীয় বই পড়ছেন কি?",
        "ধর্মীয় আলোচনা করার জন্য আপনি কোন প্রকার স্থান পছন্দ করেন?",
        "আপনি ধর্মে কোনও বিশেষ উপাস্য বা পূজার অনুষ্ঠান করছেন তা কি?",
        "ধর্মের দিকে আপনার কোনও স্বপ্ন বা অভিজ্ঞান হয়েছে কি?",
        "আপনি কোনও ধর্মীয় বা আধ্যাত্মিক কথা নিয়ে আপনার অভিপ্রায় কি?",
        "ধর্মীয় প্রশ্ন করতে যে কোনও প্রশ্নে আমি সাহায্য করতে চিরকাল প্রস্তুত আছি।",
        "ধর্মীয় বিষয়ে আমি তথ্য দিতে বিশেষভাবে দক্ষ, কিন্তু আপনার প্রশ্নের জন্য আমি ধর্মীয় বিশেষজ্ঞ নই।",
        "ধর্মীয় আলোচনা করতে কোন নিয়ম আছে কি?",
        "আপনি কোনও ধর্মিক গুরুত্বপূর্ণ স্থানে যাচ্ছেন কি?",
        "আপনার ধর্মে কোনও বিশেষ আচার-আচরণ অনুসরণ করছেন কি?"
      ]
    },
    {
      "tag": "politics",
      "patterns": [
        "রাজনৈতিক মতামত",
        "রাজনৈতিক বিষয়",
        "রাজনৈতিক আলোচনা",
        "আপনি কোন রাজনৈতিক দলের সাথে মতবাদ করছেন?",
        "রাজনীতির দিকে আপনার মতামত কী?",
        "বর্তমান রাজনীতিক অবস্থা নিয়ে আপনি কি ভাবছেন?",
        "আপনি কোনও রাজনৈতিক আলোচনা অনুষ্ঠানে অংশ নিয়েছেন কি?",
        "আপনি কোন রাজনৈতিক দল বা নেতা সামর্থ্যে বিশ্বাস করেন?",
        "রাজনৈতিক বিষয়ে আপনার কোনও অবহিত ছোট পরিচিতি আছে কি?",
        "আপনি রাজনৈতিক বিষয়ে কোনও কণ্ঠশিল্পী বা লেখকের মতামত পড়া বা শোনার অভ্যন্তরে?",
        "আপনি যে রাজনৈতিক বিষয়ে আগ্রহী, তা হলো কী?",
        "রাজনৈতিক আলোচনা করার সময় আপনি কোন ধরণের বিশ্লেষণ এবং তার উপর ভিত্তি করেন?",
        "বর্তমান সময়ের রাজনৈতিক অবস্থা আপনার কোন মতামত গড়তে চলেছে?",
        "রাজনৈতিক মূল্যবোধ করার জন্য আপনি কোন উৎস বা তথ্য ব্যবহার করেন?",
        "আপনি কোন রাজনৈতিক বিষয়ে নিজেকে শিক্ষিত বা অবস্থান দেয়া মনে করেন?",
        "আপনি কোনও রাজনৈতিক দলে অংশ নিতে চান?",
        "আপনি কোনও রাজনৈতিক কার্যক্রমে অংশ নিয়েছেন কি?",
        "রাজনৈতিক দলে যোগ দিতে হলে আপনি কোন মূল মূল্য অনুসরণ করতে চান?"
      ],
      "responses": [
        "আমি একজন রাজনীতিবিদ নই, তাই আমি রাজনৈতিক বিষয়ে মতামত দিতে পারি না। তবে, আমি আপনাকে বিভিন্ন রাজনৈতিক দল এবং তাদের নীতিগুলি সম্পর্কে জানতে উত্সাহিত করছি।",
        "রাজনীতি একটি গুদড়ির বিষয়, তার মধ্যে আপনি কী মনে করেন সেটি আমার জন্য আত্ম-উন্নত করার জন্য একটি বিশেষ ব্যক্তিগত মৌল্য।",
        "রাজনীতি দলের নীতি বা কোন রাজনৈতিক বিষয় নিয়ে আপনি কোন রকমের আলোচনা করতে পছন্দ করেন?",
        "রাজনীতি আপনার জীবনে কী অবস্থান নিয়ে রয়েছে?",
        "রাজনীতি আপনার সমাজের উন্নতির দিকে আপনার মতামত কী?",
        "রাজনীতিতে আপনি কোন বিশেষ দল বা নেতা সামর্থ্যে বিশ্বাস করেন?",
        "রাজনীতি দিয়ে সমাজের পরিবর্তনে আপনার ভূমিকা হতে চান কি?",
        "রাজনীতি দিয়ে আপনি কোন সময়ের সম্মুখ আপনার মতামত প্রকাশ করেন?",
        "রাজনীতিতে আপনি কোন সময়ের বিশ্লেষণ পড়তে চান?",
        "রাজনীতি আপনি কে প্রভাত করেছে কী ভাবে?",
        "রাজনীতি দিয়ে আপনি কোন ক্ষেত্রে চাইতে চান সমাজের পরিবর্তন?",
        "রাজনীতির দিকে আপনি কী মুখোমুখি হতে চান?",
        "রাজনীতি দিয়ে আপনি কোন সময়ে সারাবৃহৎ বা স্থানীয় সম্প্রেষণ নিয়ে যাচ্ছেন?",
        "রাজনীতির দিকে আপনি কোন সময়ের বিশ্লেষণ পড়তে চান?",
        "রাজনীতি দিয়ে আপনি কোন ক্ষেত্রে চাইতে চান সমাজের পরিবর্তন?",
        "রাজনীতির দিকে আপনি কোন সময়ে সারাবৃহৎ বা স্থানীয় সম্প্রেষণ নিয়ে যাচ্ছেন?",
        "রাজনীতি দিয়ে আপনি কোন ক্ষেত্রে চাইতে চান সমাজের পরিবর্তন?"
      ]
    },
    {
      "tag": "science",
      "patterns": [
        "বৈজ্ঞানিক প্রশ্ন",
        "বৈজ্ঞানিক বিষয়",
        "বৈজ্ঞানিক আলোচনা",
        "আপনি কোন বৈজ্ঞানিক বিষয়ে আগ্রহী?",
        "বৈজ্ঞানিক প্রবন্ধ পড়া কোনও বিশেষ কারণে?",
        "আপনি কোন বৈজ্ঞানিক বা প্রযুক্তি প্রয়োজন মনে করেন?",
        "বৈজ্ঞানিক বিষয়ে আপনার মতামত কী?",
        "আপনি কোনও বৈজ্ঞানিক প্রযুক্তি বা উপাদান নিয়ে আলোচনা করেন তা কি?",
        "বৈজ্ঞানিক প্রশ্ন করার জন্য আপনি কোন উৎস বা সূত্র ব্যবহার করেন?",
        "বৈজ্ঞানিক আলোচনা করার সময় আপনি কোন ধরণের প্রমাণ চান?",
        "বৈজ্ঞানিক প্রশ্নের জন্য আপনি কোনও বিশেষ সময় পরামর্শ নিচ্ছেন কি?",
        "আপনি কোন বৈজ্ঞানিক লেখক বা গবেষকের কাজ অনুসরণ করতে পছন্দ করেন?",
        "বৈজ্ঞানিক বিষয়ে আপনি কোনও উন্নত অধ্যয়ন করছেন কি?",
        "আপনি কোনও বৈজ্ঞানিক ঘটনা বা আবিষ্কার নিয়ে বিশেষ করে উৎসাহিত হন?",
        "বৈজ্ঞানিক প্রবন্ধ পড়ার পরে আপনি কোন বৈজ্ঞানিক বিষয়ে আরও জানতে চাচ্ছেন?",
        "আপনি কোনও বৈজ্ঞানিক বা প্রযুক্তি ক্ষেত্রে প্রযুক্তিগত উন্নতি করছেন কি?",
        "বৈজ্ঞানিক বিষয়ে আপনি কোনও বিশেষ কোনও চর্চা বা আলোচনা অনুষ্ঠানে অংশ নিয়েছেন কি?"
      ],
      "responses": [
        "আমি একজন বিজ্ঞানী নই, তাই আমি বৈজ্ঞানিক প্রশ্নের উত্তর দিতে পারি না। তবে, আমি আপনাকে বৈজ্ঞানিক গ্রন্থগুলি পড়া এবং বৈজ্ঞানিক বিশেষজ্ঞদের সাথে পরামর্শ করার পরামর্শ দিচ্ছি।",
        "বৈজ্ঞানিক বিষয়ে জানার জন্য সদ্য প্রকাশিত একটি বই রয়েছে, আপনি কি পড়তে ইচ্ছুক?",
        "বৈজ্ঞানিক প্রশ্ন করতে আমি আপনার জন্য একটি বৈজ্ঞানিক গুরুর সাথে যোগাযোগ করতে পারি।",
        "আপনি কোন বৈজ্ঞানিক বিষয়ে সবচেয়ে উদার কিছু শেখা চান?",
        "বৈজ্ঞানিক প্রবন্ধ পড়া কোন বৈজ্ঞানিক বিষয়ে আপনার মতামত কী?",
        "আপনি বৈজ্ঞানিক প্রশ্ন করতে কোন বৈজ্ঞানিক কথার জন্য অনুসরণ করতে চান?",
        "বৈজ্ঞানিক আলোচনা করার জন্য আপনি কোন ধরণের প্রশ্ন করতে পছন্দ করেন?",
        "বৈজ্ঞানিক প্রশ্ন করতে আপনি কোন উৎস বা সূত্র ব্যবহার করেন?",
        "বৈজ্ঞানিক বিষয়ে আপনি কোন আসল বা ভৌতকেন্দ্রিত গবেষণা পড়া পছন্দ করেন?",
        "বৈজ্ঞানিক বিষয়ে আপনি কোন বিশেষ কোনও চর্চা বা আলোচনা অনুষ্ঠানে অংশ নিয়েছেন কি?",
        "আপনি কোনও বৈজ্ঞানিক বা প্রযুক্তি ক্ষেত্রে প্রযুক্তিগত উন্নতি করছেন কি?",
        "বৈজ্ঞানিক বিষয়ে আপনি কোনও উন্নত অধ্যয়ন করছেন কি?",
        "আপনি কোনও বৈজ্ঞানিক ঘটনা বা আবিষ্কার নিয়ে বিশেষ করে উৎসাহিত হন?",
        "বৈজ্ঞানিক প্রবন্ধ পড়ার পরে আপনি কোন বৈজ্ঞানিক বিষয়ে আরও জানতে চাচ্ছেন?",
        "আপনি কোন বৈজ্ঞানিক বা প্রযুক্তি ক্ষেত্রে প্রযুক্তিগত উন্নতি করছেন কি?",
        "বৈজ্ঞানিক বিষয়ে আপনি কোনও বিশেষ কোনও চর্চা বা আলোচনা অনুষ্ঠানে অংশ নিয়েছেন কি?"
      ]
    },
    {
      "tag": "intellectual",
      "patterns": [
        "বুদ্ধিমত্তা",
        "বুদ্ধিমত্তার আলোচনা",
        "বুদ্ধিজীবী বিষয়",
        "বুদ্ধিমত্তার প্রশ্ন",
        "আধুনিক বুদ্ধিমত্তা",
        "বুদ্ধিমত্তার বই",
        "বুদ্ধিমত্তার উপদেশ",
        "বুদ্ধিমত্তার সাহিত্য",
        "বুদ্ধিমত্তার সংস্কৃতি",
        "বুদ্ধিমত্তা নিয়ে আলোচনা",
        "আপনি বুদ্ধিমত্তার সাথে জরিত কি?",
        "বুদ্ধিমত্তা বিষয়ে আপনার মতামত",
        "বুদ্ধিমত্তা নিয়ে কোন বই পড়ছেন?",
        "বুদ্ধিমত্তা নিয়ে আপনি কী চিন্তা করেন?",
        "আপনি বুদ্ধিমত্তা নিয়ে কোনও বই পড়ছেন কি?",
        "বুদ্ধিমত্তা নিয়ে আপনার কোন বিশেষ ধারণা আছে?",
        "আপনি বুদ্ধিমত্তা নিয়ে কোনও সেমিনারে অংশগ্রহণ করেছেন কি?",
        "বুদ্ধিমত্তার আলোচনা করতে কোনও বিশেষ প্ল্যাটফর্ম পছন্দ করেন?",
        "বুদ্ধিমত্তা নিয়ে কোনও বিশেষ ধারণা আছে কি?",
        "বুদ্ধিমত্তা নিয়ে কোনও বিশেষ আগ্রহ আছে কি?"
      ],
      "responses": [
        "বুদ্ধিমত্তা নিয়ে আলোচনা করতে আমি সর্বদা প্রস্তুত।",
        "বুদ্ধিমত্তা নিয়ে আলোচনা করতে আমি সর্বদা উদ্দীপ্ত!",
        "বুদ্ধিমত্তার সাহিত্য পড়া আমার একটি শখ।",
        "বুদ্ধিমত্তা নিয়ে কোনও বিশেষ আগ্রহ আছে কি?",
        "বুদ্ধিমত্তার আলোচনা করার জন্য সময়ের প্রয়োজন।",
        "আমি বুদ্ধিমত্তা নিয়ে আলোচনা করতে উদ্দীপ্ত এবং উদ্যোগী।",
        "বুদ্ধিমত্তা নিয়ে চিন্তা করা আমার মন আনন্দিত করে।",
        "বুদ্ধিমত্তা বিষয়ে আলোচনা করতে আমি আনন্দিত হয়।",
        "আমি বুদ্ধিমত্তার সাহিত্য পড়ে উৎসাহী হয়ে উঠি।"
      ]
    },
    {
      "tag": "event",
      "patterns": [
        "ইভেন্ট",
        "কোনও ইভেন্ট কি?",
        "কোনও ইভেন্ট কি চলছে?",
        "আমি কোনও ইভেন্টে যেতে চাই",
        "কোনও সময়ে ইভেন্টে যাওয়ার কোনও পরামর্শ আছে?",
        "আমি কোনও ইভেন্টে যাচ্ছি",
        "আমি কোনও ইভেন্টে অংশগ্রহণ করতে চাই",
        "কোনও ইভেন্টে কী হবে?",
        "কোনও ইভেন্টে কী সুযোগ আছে?",
        "কোনও ইভেন্টে কী কী হবে তা জানতে চাই",
        "আমি কোনও ইভেন্টে অংশগ্রহণ করতে চাই",
        "ইভেন্টে কী কী কাজ হতে পারে?",
        "আমি কোনও ইভেন্টে অংশগ্রহণ করতে আগ্রহী",
        "আমি কোনও ইভেন্টে যেতে চাই",
        "ইভেন্টে কী কী অনুষ্ঠান আছে?",
        "ইভেন্টে কী কী অনুষ্ঠান চলছে?",
        "কোনও ইভেন্টে কী কী ঘটনা হচ্ছে?",
        "আমি কোনও ইভেন্টে অংশগ্রহণ করতে চাই",
        "ইভেন্টে কী কী আকর্ষণীয় বিষয় আছে?",
        "আমি কোনও ইভেন্টে যেতে চাই",
        "কোনও ইভেন্ট পরিচালনা হচ্ছে কিনা?"
      ],
      "responses": [
        "ইভেন্ট হল একটি প্রতিষ্ঠানিক বা অসাধারণ সাময়িক ঘটনা, যা বিভিন্ন উদ্দেশ্যে আয়োজিত হয়।",
        "কোনও ইভেন্ট সাধারণত মানুষের সম্মিলিত হওয়ার সুযোগ দেয়, যাতে তারা একে অপরের সাথে যোগাযোগ করতে পারে এবং নতুন অভিজ্ঞতা অর্জন করতে পারে।",
        "সম্প্রতি চলমান ইভেন্ট হলে আপনি তার তথ্য ও সুযোগ-সুবিধা সম্পর্কে স্বতন্ত্র ওয়েবসাইট থেকে তথ্য পেতে পারেন।",
        "ইভেন্টে যাওয়ার আগে আপনার যেসব কাজ করতে হতে পারে তা পরিকল্পনা করুন এবং প্রয়োজনে পরামর্শ নিন।",
        "ইভেন্টে অংশগ্রহণের সময়, আপনি আপনার ব্যক্তিগত তথ্য এবং অন্যান্য প্রয়োজনীয় সামগ্রী নিয়ে যাবেন।",
        "ইভেন্টে যাওয়ার আগে সময়ে সমস্যা হলে সংশ্লিষ্ট সংস্থা বা সংস্থা সাথে যোগাযোগ করুন।",
        "ইভেন্টে অংশগ্রহণের সময় আপনার যে সামগ্রী নিয়ে যেতে হবে তা ভালভাবে পরীক্ষা করুন এবং প্রয়োজনে নিবন্ধন করুন।",
        "ইভেন্টে অংশগ্রহণের সময়, নিজের যেসব লাভ ও প্রয়োজনীয়তা থাকবে তা পরিকল্পনা করুন।",
        "ইভেন্টে অংশগ্রহণের সময় নিজের আগ্রহ এবং আশা স্থাপন করুন।",
        "আপনি যদি ইভেন্টে অংশগ্রহণ করতে চান, তবে অনুশীলন করুন এবং নিজের সময় পরিকল্পনা করুন।"
      ]
    },
    {
      "tag": "Universe",
      "patterns": [
        "বিশ্ব সম্পর্কে আমার কিছু প্রশ্ন আছে",
        "বিশ্ব এবং সৃষ্টির গভীর আলোচনা",
        "আমরা বিশ্বের বিষয়ে আরও কিছু জানতে চাই",
        "সময় ও বিশ্বের সৃষ্টির মৌলিক প্রশ্ন",
        "বিশ্ব এবং তার গতি সম্পর্কে আমার অজানা কিছু বিষয় আছে",
        "বিশ্বের উৎপত্তি ও বিস্তার সম্পর্কে কিছু জানতে চাই",
        "আমার মনে হচ্ছে বিশ্বের সৃষ্টি সম্পর্কে আরও কিছু জানতে চাই",
        "বিশ্বের গভীর রহস্য ও অজানা বিষয় নিয়ে আমার অভিপ্রায় জানতে চাই",
        "আমরা আমাদের বিশ্বের প্রাথমিক প্রকৃতি নিয়ে আরও কিছু জানতে চাই",
        "স্থান, তারকা এবং বিশ্বের অজানা বিষয়ে আমার অনেক প্রশ্ন আছে",
        "আমরা বিশ্বের সৃষ্টি ও বিস্তার সম্পর্কে আরও কিছু জানতে চাই",
        "আমাদের বিশ্ব নিয়ে আরও গভীর আলোচনা করতে চাই",
        "আমার বিশ্বের সম্পর্কে অনেক প্রশ্ন আছে, আমি কি করতে পারি?"
      ],
      "responses": [
        "বিশ্বের গভীর অজানা বিষয়ে অনেক গবেষণা চলছে, আমরা সময়ের সাথে আরও অনেক জিজ্ঞাসা সম্পর্কে জানতে পারবো।",
        "বিশ্বের বিষয়ে অনেক ধারাবাহিক ধারণা ও গবেষণা চলছে, এবং নতুন আবিষ্কার ও সিদ্ধান্ত হয়ে যাচ্ছে।",
        "বিশ্বের গভীর রহস্য আরও অন্যান্য বিজ্ঞানীদের কাছে চিন্তা ও অনুসন্ধানের বিষয়।",
        "বিশ্বের সৃষ্টি ও বিস্তার সম্পর্কে আমাদের বর্তমান জ্ঞান অত্যন্ত সীমাবদ্ধ এবং অনেক বিষয়ে আমরা এখনো বুঝতে পারিনি।",
        "বিশ্ব এবং তার উৎপত্তি সম্পর্কে আমাদের ধারণা প্রতিদিন পরিবর্তন হচ্ছে এবং সম্প্রতি গবেষণার জন্য অনেক প্রকল্প শুরু হয়েছে।",
        "স্পেস এক্সপ্লোরেশন ও কসমোলজি নতুন দিনের উজ্জ্বল হোক তা নিয়ে গবেষণা ও আলোচনা চলছে।",
        "বিশ্বের প্রাথমিক প্রকৃতি এবং প্রাথমিক বিষয়বস্তু নিয়ে আমরা এখনো অনেক বুঝতে পারিনি, কিন্তু গবেষণা চলছে।",
        "আমরা যখন বিশ্ব এবং তার উৎপত্তি নিয়ে আলোচনা করছি, তখন আমরা নতুন ধারণাগুলি এবং সিদ্ধান্তগুলি তৈরি করতে পারি।",
        "বিশ্ব এবং তার সৃষ্টি নিয়ে নতুন সিদ্ধান্ত এবং অধ্যয়নের ক্ষেত্রে আমরা আরও অগ্রগতি করতে চাই।"
      ]
    },
    {
      "tag": "poetry",
      "patterns": [
        "কবিতা",
        "কবিতা পড়া",
        "কবিতা লেখা",
        "আমি কবিতা পড়তে পছন্দ করি",
        "কবিতা আবৃত্তি",
        "কবিতা প্রেম",
        "কবিতা সংগ্রহ",
        "কবিতা পড়তে ভালো লাগে",
        "কবিতা লেখার প্রেমিকা",
        "কবিতা অপরাহ্ণে",
        "কবিতা প্রকাশ",
        "কবিতা কাব্য",
        "আপনি কি কবিতা পড়েন?",
        "আপনার প্রিয় কবিতা কোনটি?",
        "আপনি কি কবিতা লেখেন?",
        "কবিতা পড়ার জন্য কেউ কি সুপারিশ করেছেন?",
        "আপনার কবিতা পড়ার সময়ের প্রিয় স্থান কোথা?",
        "কবিতা পড়ার জন্য আপনি কোন ধরণের কবিতা পছন্দ করেন?",
        "কবিতা পড়ে আপনার ভাবনা কি হয়?",
        "কবিতা পড়া কোন ধরণের বিনোদন?",
        "কবিতা পড়ার সময়ে আপনি কি অনুভূতি পান?",
        "কবিতা কবিতা পড়তে ভালো লাগে"
      ],
      "responses": [
        "কবিতা আসে যেখানে হাসির সঙ্গে কষ্টের সহযোগিতা, সেখানে জীবনের সারা গুলো আবেগের সীমানার পরে প্রতিফলিত হয়ে উঠে।",
        "কবিতা আবেগের একটি রোমাঞ্চক অধ্যায়, যা প্রকৃতপক্ষে মানুষের মন ও মনের সাথে সংযোগ করে।",
        "কবিতা লেখা একটি অলংকরণ প্রক্রিয়া, যা অকার্যকর আত্মা নিয়ে একটি সহায়ক হাত প্রদান করে।",
        "কবিতা পড়া আমার জীবনের একটি অপরিসীম উদ্যান, যেখানে মন আকাশে উড়ে যায়।",
        "কবিতা কবিতা আমার সাথে যেখানে আলোর দিকে প্রেরিত করে, তেখেতে আমি প্রতিবাদ বিস্তার করি।",
        "কবিতা কবিতা একটি মনের পাখি, যা আকাশে উড়ে যায় অনিবার্যভাবে সারা বিশ্বের বাসিন্দা মনের দুঃখ ও সুখ বোধ করতে।",
        "কবিতা পড়া আমার জীবনের অবশ্যই অংশ, যা আমাকে মনের আলোকে পথ দেখায়।",
        "কবিতা পড়া আমার জীবনের একটি অমূর্ত অংশ, যা আমাকে আনন্দ ও শোকের মধ্যে আমার বিস্তারিত মনোবল দেয়।",
        "কবিতা পড়া আমার জীবনের প্রধান অংশ, যা আমার চিন্তা ও বিচার পথে আন্তরিক রূপে নির্দেশ করে।",
        "কবিতা পড়া আমার আত্মসাথে যোগাযোগ করতে সাহায্য করে এবং আমাকে নতুন দিকে দেখায়।",
        "কবিতা পড়া আমাকে নতুন সৃষ্টির মধ্যে প্রবেশ করতে সাহায্য করে এবং আমার মনের মধ্যে নতুন দৃশ্য সৃষ্টি করে।",
        "কবিতা পড়া আমার মনের সার্থকতা ও শুদ্ধতা উন্নত করে এবং আমাকে জীবনের সাহায্য করে সুন্দরভাবে বাঁচতে।",
        "কবিতা পড়া আমার মনের প্রতিটি কোণে আলো এবং অন্ধকারের পরিমাণ বা সংমিশ্রণ বেশি করে।",
        "কবিতা পড়া আমাকে নতুন বিচার ও ধারণা অর্জন করতে সাহায্য করে এবং আমাকে জীবনের বিভিন্ন দিকে পরিচিত করে।",
        "কবিতা পড়া আমার মনের স্থানগুলি অবিশ্বাস্য ভাবে পরিবর্তন করে এবং আমাকে নতুন মুকুলের উদ্ভাবন করে।",
        "কবিতা পড়া আমার মনের সান্ত্বনা ও আনন্দ বৃদ্ধি করে এবং আমাকে নতুন আশা দেয়।",
        "কবিতা পড়া আমার মনের সমস্ত অসীম দরিদ্রতা ও আত্মার অনধিকারিত শক্তিতে পরিণত হয় এবং আমাকে নতুন দিকে দেখায়।",
        "কবিতা পড়া আমার মনের সমস্ত মোহ ও আশা ভুলে যায় এবং আমাকে নতুন প্রকৃতির আনন্দ অনুভব করে।",
        "কবিতা পড়া আমার মনের সমস্ত বিরক্তি ও নিখোঁজ কামনা অপসারণ করে এবং আমাকে নতুন জীবনের কাছে নিয়ে যায়।"
      ]
    },
    {
      "tag": "philosophy",
      "patterns": [
        "দর্শন সম্পর্কে আমি কিছু জানতে চাইছি",
        "দর্শনে আমি শিখতে চাই?",
        "দর্শনে কোনও বিশেষ ধারণা আছে কি?",
        "দর্শনে মন্তব্য করতে চান",
        "দর্শন সম্পর্কে আমার অবধারণা ভালো করতে চাই",
        "দর্শনের বিষয়ে আমার কোনও প্রশ্ন?",
        "আপনার দর্শন সম্পর্কে কী মন্তব্য আছে?",
        "দর্শনে কী কী বিষয়ে আপনার মতামত আছে?",
        "দর্শনের কোন বিষয়ে আপনার অভিপ্রায় কী?",
        "দর্শনের বিষয়ে আপনার ধারণা কী?",
        "দর্শনে কোনও ধারণায় আপনার মতামত কী?",
        "দর্শনে আপনার কোন নতুন ধারণা আছে?",
        "দর্শনে কোনও প্রশ্নের জন্য আমি আপনাকে সাহায্য করতে পারি কি?"
      ],
      "responses": [
        "দর্শন মানে জীবনের স্বর্ণিম বিচার।",
        "দর্শন কি? এটি মানুষের প্রশ্ন ও উত্তরের অতীত, বর্তমান এবং ভবিষ্যৎ সম্পর্কে চিন্তা করার একটি পথ।",
        "দর্শনের আলোচনা হচ্ছে মানুষের সংসারের অদ্ভুত প্রশ্ন ও তাদের উত্তরের অন্যত্রিণ সমীপের অনুসন্ধান।",
        "দর্শন মানে মানুষের চেতনার বেগুনাপূর্ণ খোঁজ।",
        "দর্শনে বোধগম্যতা এবং সত্যতা খুঁজে খুঁজে সম্পর্কে চিন্তা করা হয়।",
        "দর্শন মানে পরম বিচারের মধ্যে পাতিত হওয়ার সাহস।",
        "দর্শনে মানুষ তার নিজের বিচারের বশীভূত হতে চায়।",
        "দর্শন মানে জ্ঞানের অনন্ত অনুসন্ধান।",
        "দর্শন একটি চোখ যা বিশ্বকে দেখে এবং বোঝা শিখে।",
        "দর্শন মানে সত্যের অনুভূতি এবং তার জন্য ত্রাণ।",
        "দর্শন একটি উচ্চ ধরণের চিন্তা পথ।",
        "দর্শন মানে মানুষের জীবনের আদি ও অন্ত।",
        "দর্শনে জীবনের সত্যতা খুঁজে খুঁজে সম্পর্কে চিন্তা করা হয়।",
        "দর্শন মানে প্রকৃতির অজানা গোপন রহস্য উজ্জ্বল করা।",
        "দর্শন মানে সৃষ্টিকে উপস্থাপন করা এবং তার অজানা গোপন রহস্য খুঁজে খুঁজে তার সাথে মেলানো।",
        "দর্শন মানে জীবনের আদিম চেতনার সন্ধান।"
      ]
    },
    {
      "tag": "love",
      "patterns": [
        "আমি কিভাবে কাউকে ভালোবাসতে পারি?",
        "কি করে আমি আমার প্রেমিকের প্রেম প্রকাশ করতে পারি?",
        "আমি আমার প্রেমিকের জন্য কি উপহার করতে পারি?",
        "কীভাবে আমি কাউকে প্রেম প্রকাশ করতে পারি যার সাথে আমি অনুভব করি?",
        "প্রেমের জন্য আমি কি করতে পারি?",
        "প্রেমিকের জন্য সময় কিভাবে বেঁচে থাকার অনুরোধ করতে পারি?",
        "প্রেমিকের আমি কী কী দরকারে আসতে পারি তা কি?",
        "আমি আমার প্রেমিকের সাথে কীভাবে সময় কাটাতে পারি?",
        "আমি কীভাবে আমার প্রেমিকের সাথে আমার ভাবনা ভাগ করতে পারি?",
        "আমি কী করতে পারি যখন আমি আমার প্রেমিকের দুঃখ দেখি?",
        "আমি কীভাবে আমার প্রেমিকের জন্য আমার প্রতিশ্রুতি পূরণ করতে পারি?",
        "আমি কীভাবে আমার প্রেমিকের জন্য উৎসাহী হতে পারি?",
        "আমি কী করতে পারি আমার প্রেমিকের জন্য খুশি করতে?",
        "প্রেমিকে সাথে সময় কাটানোর জন্য আমি কী করতে পারি?",
        "আমি কী করতে পারি আমার প্রেমিকের সাথে আরো ঘনিষ্ঠ হতে?",
        "প্রেমিকের সাথে সময় কাটানোর জন্য আমি কী করতে পারি?"
      ],
      "responses": [
        "প্রেমের সাথে প্রেম প্রকাশ করার জন্য কোথাও বিশেষ সাথে যাওয়া বা একটি সুন্দর কার্ড প্রেমিকের কাছে পাঠানো হতে পারে।",
        "আপনি আপনার প্রেমিকের জন্য একটি প্রতিটি সময় বিশেষ করে করে উপহার করতে পারেন।",
        "আপনি আপনার প্রেমিকের সাথে সময় কাটাতে একটি মিলনস্থলে যেতে পারেন বা একটি স্পেশাল ডেটে যাত্রা করতে পারেন।",
        "প্রেমিকের প্রতি সাহানুভুতি ও পরিমাণগুলির সাথে আপনি তারা সাথে ভাগ করতে পারেন এবং তাদের সমর্থন দিতে পারেন।",
        "আপনি আপনার প্রেমিকের প্রতিটি সন্ধ্যার জন্য একটি মেসেজ পাঠাতে পারেন যা তাকে আপনার প্রিয়জন হিসেবে বিবেচিত করে।",
        "প্রেমিকের জন্য আপনি প্রতি সময় সাথে সময় কাটাতে পারেন এবং তাদের সাথে যে যে বিষয়ে আপনার আনন্দ হয় তা শেয়ার করতে পারেন।",
        "আপনি যখন আপনার প্রেমিকের দুঃখ দেখতে পান তখন তার পাশে থাকার জন্য প্রতি সময় সাথে থাকার জন্য নিজেকে সাজানো প্রয়োজন।",
        "প্রতিশ্রুতি পূরণ করার জন্য আপনি আপনার প্রেমিকের সাথে যেকোনো কিছু করতে পারেন যা তাকে আনন্দ দেয় এবং তার জন্য গুরুত্বপূর্ণ।",
        "আপনি আপনার প্রেমিকের সাথে সময় কাটাতে পারেন এবং তাদের জন্য কোনও নিয়মিত সময় নিতে পারেন যেখানে আপনি একে অপরের সাথে সাংগঠনের সৃষ্টি করতে পারেন।",
        "আপনি আপনার প্রেমিকের সাথে অধিক সময় কাটাতে পারেন যাতে আপনি দুটির মধ্যে আরো ঘনিষ্ঠতা এবং সংবাদ গড়ে তোলতে পারেন।",
        "প্রেমিকের সাথে সময় কাটানোর জন্য আপনি প্রতি সপ্তাহে একটি বিশেষ সময় নিতে পারেন যেখানে আপনি দুটি একে অপরের সাথে প্রেমের প্রতি আরো বেশি সময় কাটাতে পারেন।",
        "প্রেমিকে সাথে সময় কাটানোর জন্য আপনি সবসময় তাদের সাথে কিছু বেশি সময় কাটাতে চান এবং তাদের সাথে আপনার সমস্ত বিচার ও ভাবনা ভাগ করতে পারেন।"
      ]
    },
    {
      "tag": "TV series",
      "patterns": [
        "টিভি সিরিজ",
        "প্রিমিয়ার সিরিজ",
        "টেলিভিশন ধারাবাহিক",
        "কোনও পছন্দের টিভি সিরিজ আছে?",
        "টিভি সিরিজে কোনও প্রিফারেন্স?",
        "প্রিমিয়ার সিরিজে কী ধরনের সিরিজ দেখতে পছন্দ করেন?",
        "টিভি সিরিজ দেখার সময় কি ধরণের সিরিজ পছন্দ করেন?",
        "টেলিভিশন ধারাবাহিক কোন ধরণের সিরিজ দেখতে পছন্দ করেন?",
        "আপনার প্রিয় টিভি সিরিজের নাম কি?",
        "টিভি সিরিজে কোন কোন অভিনেতা-অভিনেত্রী আছে?",
        "কোন টিভি সিরিজের প্রথম সিজন দেখেছেন?",
        "টিভি সিরিজে কোন কোন চরিত্র পছন্দ করেন?",
        "আপনি কোন জনপ্রিয় টিভি সিরিজের অনুকরণ করতে চান?",
        "টিভি সিরিজে কোন ধরণের জন্যে আপনি অধিক আগ্রহী?",
        "আপনার পছন্দের টিভি সিরিজের জন্য পুরস্কারের কি প্রয়োজন?",
        "টিভি সিরিজে কোন কোন ধরণের অপারেটর দেখতে পছন্দ করেন?",
        "আপনার পছন্দের টিভি সিরিজে কোন কোন বিষয়ে আলোচনা হয়?",
        "আপনি কোন টেলিভিশন ধারাবাহিক সিরিজের প্রচারিত সিজন দেখতে চান?",
        "টিভি সিরিজে আপনার কোন কোন ট্রেলার দেখা আছে?",
        "আপনি কোনও নতুন টিভি সিরিজ শুরু করতে চান কি?",
        "টিভি সিরিজ দেখার সময় আপনি কি অধিকাংশই একাধিক সিজন একসাথে দেখেন?"
      ],
      "responses": [
        "টিভি সিরিজ দেখা করা খুবই রম্য।",
        "প্রিমিয়ার সিরিজ অনেক সময় মান দেয়।",
        "টেলিভিশন ধারাবাহিক দেখতে পছন্দ করি।",
        "আমি 'Game of Thrones' এর প্রত্যেক সিজন প্রথম দেখেছি।",
        "আপনার প্রিয় টিভি সিরিজের নাম কী?",
        "আমি 'Stranger Things' এর একজন অনুভবপ্রিয় দর্শক।",
        "আপনি কোন জনপ্রিয় টিভি সিরিজের অনুকরণ করতে চান?",
        "টিভি সিরিজে কোন ধরণের জন্যে আপনি অধিক আগ্রহী?",
        "আপনার পছন্দের টিভি সিরিজের জন্য পুরস্কারের কি প্রয়োজন?",
        "আপনার পছন্দের টিভি সিরিজে কোন কোন বিষয়ে আলোচনা হয়?",
        "টিভি সিরিজে আপনার কোন কোন ট্রেলার দেখা আছে?",
        "আপনি কোনও নতুন টিভি সিরিজ শুরু করতে চান কি?",
        "টিভি সিরিজ দেখার সময় আপনি কি অধিকাংশই একাধিক সিজন একসাথে দেখেন?"
      ]
    }
  ]
}
